{
  "backend/main.mo": "Defines a backend actor with storage mixins, access control, user approval, and numerous app data types including profiles, game progress, chat, events, rewards, and parental controls.",
  "feature_evidence.json": "Contains feature evidence entries describing required fixes for Art Gallery upload authentication and error‑reporting improvements.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend files, summarizing functionality for pages, components, and hooks across the app.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React application router that imports all pages and games, sets providers, and renders the full app layout.",
  "frontend/src/components/AchievementCelebration.tsx": "Implements a global celebration UI with confetti or fireworks effects, using a queue system and React portals.",
  "frontend/src/components/ApprovalPending.tsx": "UI wrapper that checks user approval status and shows a request-approval flow before granting access to protected content.",
  "frontend/src/components/EmotionFeedback.tsx": "Displays temporary animated encouragement messages using a global queue and portal, with a helper to trigger feedback events.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/GameLayout.tsx": "Provides a reusable game screen layout with header, scores, sound toggle, pet upgrades, and achievement triggers.",
  "frontend/src/components/Header.tsx": "Implements the main app header with authentication controls, navigation buttons, and optional admin access.",
  "frontend/src/components/HomepageFeatures.tsx": "Displays a grid of feature cards highlighting various app modules with icons and descriptions.",
  "frontend/src/components/InstantMiniActivity.tsx": "Implements three mini-games for different age groups with canvas-based interactions, timers, and scoring.",
  "frontend/src/components/learn-hub/ArtsMusicActivity.tsx": "Activity component that runs various arts and music mini‑games (color mixing, drawing, rhythm, instruments, creative prompts) based on lesson ID with progress and scoring.",
  "frontend/src/components/learn-hub/DiscoveryZoneActivity.tsx": "Activity component for discovery-themed games such as facts, how‑it‑works, world explorer, and inventions, with step progression and scoring.",
  "frontend/src/components/learn-hub/ReadingVocabularyActivity.tsx": "Reading and vocabulary activity handling phonics, word-building, stories, spelling, and vocabulary games with progress tracking.",
  "frontend/src/components/learn-hub/ScienceNatureActivity.tsx": "Science and nature activity supporting weather, space, animals, and plants games, each with quizzes or matching tasks.",
  "frontend/src/components/MascotGuide.tsx": "Shows a contextual mascot helper that displays messages per page, with optional voice playback and a collapsible UI.",
  "frontend/src/components/ProfileSetup.tsx": "Form component allowing kids to enter name and age and submit a profile via mutateAsync, with validation and styled UI.",
  "frontend/src/content/seasonalEventStories.ts": "Exports a dataset of kid‑safe seasonal stories with IDs, text, and narration scripts for read‑along experiences.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity, recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, logout, and stored identity restoration using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines query and mutation helpers plus many frontend types for interacting with backend data such as users, badges, artwork, chat, and events.",
  "frontend/src/index.css": "Sets global Tailwind styles, fonts, and theme variables for light and dark modes including colors and layout defaults.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements an admin dashboard UI for viewing stats, managing users, and applying or removing restrictions using query hooks.",
  "frontend/src/pages/ArtGalleryPage.tsx": "Provides an artwork gallery UI allowing users to upload images, preview them, and submit to private or public galleries.",
  "frontend/src/pages/AvatarCreatorPage.tsx": "Provides an avatar builder with selectable parts, randomization, preview, and save support via API hooks.",
  "frontend/src/pages/CertificatesPage.tsx": "Generates achievement certificates using canvas, allows custom text, previews, downloads, and lists user certificates.",
  "frontend/src/pages/ChatModule.tsx": "Implements a local chat UI with contacts, message history, emoji support, and basic message sending.",
  "frontend/src/pages/ChatPage.tsx": "Real-time chat using backend queries for online users and messages, with identity-based messaging and auto-refresh.",
  "frontend/src/pages/CraftDIYPage.tsx": "Displays craft projects by category, shows steps and materials, and marks projects completed with badge rewards.",
  "frontend/src/pages/CreativeFunHub.tsx": "Hub page listing creative modules with descriptions, icons, and navigation to each activity.",
  "frontend/src/pages/DanceChallengePage.tsx": "Dance challenge UI that lets users pick routines, cycle through poses, and optionally use the camera via a custom hook.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard listing navigable app modules with search, authentication checks, and admin-only visibility.",
  "frontend/src/pages/EventCardCreator.tsx": "Interactive event card designer with templates, fonts, stickers, and download/share actions.",
  "frontend/src/pages/EventCardsPage.tsx": "Card creation interface allowing templates, colors, and preview, plus a simple gallery tab.",
  "frontend/src/pages/EventsModule.tsx": "Event manager for creating, listing, and styling events with types, dates, icons, and metadata.",
  "frontend/src/pages/EventsPage.tsx": "Renders an events page with local event state, add-form UI, and a dismissible event notification component using timers and badges.",
  "frontend/src/pages/FeedbackPage.tsx": "Provides a feedback submission form with type selection, textarea input, and integration with feedback query/mutation hooks.",
  "frontend/src/pages/FeedbackSystem.tsx": "Implements an alternate feedback form with satisfaction icons, type selection, and basic validation before showing success toasts.",
  "frontend/src/pages/FunnyFartHub.tsx": "Displays a large list of themed fart sound buttons with metadata and navigation support for a humorous soundboard module.",
  "frontend/src/pages/games/AmbulanceRescue.tsx": "A timed rescue game where the player moves an ambulance to save patients, tracking score, high score, and spawning patients dynamically. Handles keyboard movement, collisions, and game state.",
  "frontend/src/pages/games/BalloonPop.tsx": "Balloon popping game using requestAnimationFrame to animate balloons, track score, spawn types, and render pop effects. Includes timing, high score logic, and touch/click interactions.",
  "frontend/src/pages/games/BibbleAdventure.tsx": "Platformer game with jumping physics, coin collection, and falling hazards. Manages player movement, gravity, platform collisions, and score progression.",
  "frontend/src/pages/games/BirthdayCakeDecorator.tsx": "Interactive cake-decorating game where users place emoji decorations on a cake to earn points and finish for a final score.",
  "frontend/src/pages/games/BirthdayCakeMaker.tsx": "Step-based cake-making game where players choose base, flavor, and layers to build a cake and accumulate points.",
  "frontend/src/pages/games/BossesLearnHabits.tsx": "Boss fight game where the boss learns player movement patterns to predict attacks while the player dodges and shoots.",
  "frontend/src/pages/games/BossFightOnly.tsx": "Canvas boss-fight game with player movement, projectiles, multi-phase bosses, and score progression across bosses.",
  "frontend/src/pages/games/CatGrapplingHook.tsx": "Physics-based grappling hook game where a cat swings, collects food, avoids enemies, and accumulates score.",
  "frontend/src/pages/games/CityMovingPlatforms.tsx": "Canvas platformer where the player jumps across rotating moving platforms; manages physics, collisions, scoring, and game over state.",
  "frontend/src/pages/games/ControlEnemies.tsx": "Game where the player moves automatically toward a goal while the user controls enemies to obstruct them; includes level progression and enemy selection.",
  "frontend/src/pages/games/CronkerKontry.tsx": "Incremental resource‑management game with buildings, upgrades, prestige, and achievements generating gold, food, and power over time.",
  "frontend/src/pages/games/DelayedControls.tsx": "Movement game where inputs are delayed via a queued system; includes obstacles, coins, and collision handling with scoring.",
  "frontend/src/pages/games/DungeonJanitorSimulator.tsx": "Top‑down cleaning game where the player moves around removing debris types for points while new debris spawns over time.",
  "frontend/src/pages/games/EclipseNowSolo.tsx": "Top-down space survival game managing player movement, enemies, projectiles, energy orbs, and adaptive difficulty with AI hints.",
  "frontend/src/pages/games/EnemiesPlatforms.tsx": "Platformer where flying enemies act as moving platforms the player jumps across to reach a goal while avoiding attacks.",
  "frontend/src/pages/games/EnemyControlsCamera.tsx": "Arena game where an enemy controls the camera while the player collects coins and avoids being caught.",
  "frontend/src/pages/games/EscapeRoomUniverse.tsx": "Multi-room escape game where players find hidden items, unlock new themed rooms, and race against a countdown timer.",
  "frontend/src/pages/games/EverythingBreaks.tsx": "Platformer where platforms break after use, forcing the player to move quickly toward the goal while managing jumps and timing.",
  "frontend/src/pages/games/EverythingIsButton.tsx": "Canvas-based game where clicking randomized buttons triggers actions affecting the player and score, with movement handled by keyboard input.",
  "frontend/src/pages/games/FamousPlaces.tsx": "Multiple‑choice quiz asking locations of famous landmarks, tracking score, question progression, and high score.",
  "frontend/src/pages/games/FinalBoss.tsx": "Defense game where the player places traps to stop advancing heroes from damaging a boss, with waves, scoring, and trap selection.",
  "frontend/src/pages/games/FloorIsLiar.tsx": "Platformer where platforms may lie about being safe, requiring careful navigation to reach a goal while managing movement and collisions.",
  "frontend/src/pages/games/ForestNight.tsx": "Top‑down movement game in a dark forest where the player collects coins to increase score and visibility while racing against a timer.",
  "frontend/src/pages/games/GadgetCombat.tsx": "Top‑down gadget combat game where enemies spawn, move toward the player, and can be stunned or captured using different gadgets with cooldowns.",
  "frontend/src/pages/games/GlitchWorldEscape.tsx": "Platformer with glitch mode that toggles which platforms are solid while the player jumps, moves, and avoids falling to keep progressing.",
  "frontend/src/pages/games/GrandmaSecretArcade.tsx": "Canvas arcade hub featuring three minigames—whack‑a‑mole, catch, and memory—with dynamic grandma messages and score tracking.",
  "frontend/src/pages/games/InventoryIsEnemy.tsx": "Top‑down survival game where inventory weight slows the player and causes damage while collecting items, avoiding enemies, and reaching a goal.",
  "frontend/src/pages/games/LiesAndTruths.tsx": "Platformer centered on truth‑or‑lie hints about platform safety as the player navigates platforms toward a goal with jumping and gravity.",
  "frontend/src/pages/games/MemoryMatch.tsx": "A React memory match game that manages cards, levels, scoring, and matching logic with dynamic grid sizes.",
  "frontend/src/pages/games/MindMazePuzzle.tsx": "A puzzle maze game where each room has a color, pattern, or sequence puzzle that increases score when solved.",
  "frontend/src/pages/games/MonsterMaze.tsx": "A canvas-based maze navigation game with moving monsters, collision detection, scoring, and an exit goal.",
  "frontend/src/pages/games/MoveWhenBlink.tsx": "A blink‑activated movement game where the player moves only during a timed blink window while avoiding enemies.",
  "frontend/src/pages/games/NumberRunner.tsx": "A lane‑runner math game generating obstacles with math problems the player must answer while avoiding collisions.",
  "frontend/src/pages/games/OneButtonHero.tsx": "Canvas runner where a single button controls jump, dash, or shield based on press duration, with obstacle spawning and collision logic. Manages physics, cooldowns, scoring, and input timing.",
  "frontend/src/pages/games/OneRoomInfiniteGames.tsx": "Mini‑game collection that randomly switches between dodge, collect, memory, and platformer modes, each with its own state and mechanics. Tracks score, timers, and per‑mode input handling.",
  "frontend/src/pages/games/PacMan.tsx": "Grid‑based Pac‑Man clone with movable ghosts, pellets, walls, and keyboard‑controlled movement. Manages maze generation, collision rules, scoring, lives, and animation timing.",
  "frontend/src/pages/games/PauseMechanic.tsx": "Top‑down collect‑and‑avoid game with a pause feature that triggers random effects like spawning, rewinding, or teleporting. Tracks movement, hazards, coins, history, and pause state.",
  "frontend/src/pages/games/PoliceBuddyChase.tsx": "Lane‑based chasing game where the player switches lanes to catch criminals while avoiding escapes. Handles spawning, movement, scoring, difficulty scaling, and game over logic.",
  "frontend/src/pages/games/PumpkinSmash.tsx": "Canvas game where bouncing pumpkin emojis move and the player clicks them to score before a timer ends, with continuous spawning and score tracking.",
  "frontend/src/pages/games/ReverseProgression.tsx": "Platformer where abilities are removed each level, using keyboard controls, physics, enemies, platforms, and a goal to progress.",
  "frontend/src/pages/games/ScreenIsEnemy.tsx": "Top‑down coin‑collecting game where random screen effects harm the player as they move and gather coins for points.",
  "frontend/src/pages/games/ShapeShiftingWorld.tsx": "Player swaps between forms to bypass obstacles and collect items across levels, with simple movement and collision checks.",
  "frontend/src/pages/games/SlimeEvolutionArena.tsx": "Arena survival game where the slime evolves temporarily while dodging and interacting with various enemy types to gain score.",
  "frontend/src/pages/games/SoundBasedWorld.tsx": "Canvas-based movement game using sound-wave effects, obstacles, and goal detection with simple physics and keyboard controls.",
  "frontend/src/pages/games/SpaceInvaders.tsx": "Browser Space Invaders clone with waves of enemies, bullets, player movement, scoring, and game loop timing.",
  "frontend/src/pages/games/SpaceStationLife.tsx": "Resource‑management game where roles, random events, and day cycles affect resources, score, and survival.",
  "frontend/src/pages/games/SpeedIsHealth.tsx": "Canvas action game where player speed affects health, with obstacles, coins, and momentum-based movement.",
  "frontend/src/pages/games/SpiderWebPuzzle.tsx": "Puzzle game generating connected web nodes that players disconnect to clear levels and win.",
  "frontend/src/pages/games/SuperpowerTraining.tsx": "Side‑scrolling obstacle game where the player moves, unlocks powers, and interacts with obstacles based on active abilities.",
  "frontend/src/pages/games/SuperSpeedyRacer.tsx": "Endless runner racing game where the player switches lanes to avoid obstacles, with increasing speed and score tracking.",
  "frontend/src/pages/games/Tetris.tsx": "Implementation of Tetris with falling pieces, line clearing, scoring, and full board/rotation logic.",
  "frontend/src/pages/games/ThemeParkBuilder.tsx": "Theme park management game where players place rides, manage cash, happiness, and generate income over time.",
  "frontend/src/pages/games/TicTacToe.tsx": "Tic‑tac‑toe game supporting PvP and AI modes with win checking, draw detection, and simple AI logic.",
  "frontend/src/pages/games/TimeControlAdventure.tsx": "A complex time‑manipulation survival game with spawning enemies, projectiles, coins, and cooldown‑based time powers. Manages a continuous animation loop, player state, difficulty scaling, and various spawn timers.",
  "frontend/src/pages/games/TimeLoopPizzaDelivery.tsx": "A canvas-based delivery game with time loops, obstacles, and pizzas to deliver before the timer resets. Tracks player movement, obstacle removal, and repeated loop progression.",
  "frontend/src/pages/games/TinyHeroGiantWorld.tsx": "A side‑scrolling platformer where a tiny player navigates oversized world objects, collects coins, and reaches a distant goal. Includes physics, collisions, camera tracking, and large static environment objects.",
  "frontend/src/pages/games/TutorialIsVillain.tsx": "A joke tutorial game where the tutorial character sabotages the player with traps, fake coins, and misleading instructions. Handles timed messages, trap spawning, player movement, and health interactions.",
  "frontend/src/pages/games/WordWizard.tsx": "A timed word‑scramble puzzle game where players form correct words from shuffled letters. Manages rounds, scoring, timers, and tracking discovered words.",
  "frontend/src/pages/games/YoureLateAlways.tsx": "React canvas-based mini-game managing player movement, projectiles, explosions, fires, and level-based chaos. Handles input, game loop updates, collisions, and restart logic.",
  "frontend/src/pages/GamesHub.tsx": "Shows a catalog of games with icons, categories, and difficulty options, enabling navigation to individual game modules.",
  "frontend/src/pages/GamesModule.tsx": "Displays a tabbed game library with filtering by type and renders game cards with progress and difficulty. Manages selection state and UI layout for browsing games.",
  "frontend/src/pages/GreenScreenFunPage.tsx": "Lets users upload or capture a photo and place it into preset cartoon scenes. Handles camera usage, image compositing on canvas, and downloading the final image.",
  "frontend/src/pages/InteractiveShortsPage.tsx": "Implements interactive branching stories where users choose scenes and navigate through story paths. Supports story selection, scene rendering, and restart navigation.",
  "frontend/src/pages/JokesGenerator.tsx": "Provides a local joke generator with categories, random selection, favorites, sharing, and audio playback actions. Manages joke state, searching, and simple interactions.",
  "frontend/src/pages/JokesPage.tsx": "Renders a joke hub using backend queries for listing, submitting, rating, and favoriting jokes. Supports category filtering, random selection, and CRUD-like interactions.",
  "frontend/src/pages/KaraokeModePage.tsx": "Implements a karaoke page with selectable songs, timed lyric progression, and playback controls.",
  "frontend/src/pages/LearnHubPage.tsx": "Defines the learning hub with categorized lessons, progress tracking, and interactive activity components.",
  "frontend/src/pages/MusicRemixPage.tsx": "Provides a music remix tool enabling loop selection, mixing, playback, visualization, and remix submission.",
  "frontend/src/pages/ParentalControl.tsx": "Renders parental control settings including screen time, content filters, and admin user approvals.",
  "frontend/src/pages/ProfileCustomization.tsx": "Allows users to edit profile info, avatars, and themes, loading and saving profile data via hooks.",
  "frontend/src/pages/RewardsAchievements.tsx": "Static achievements, badges, and challenges displayed with progress and themed cards.",
  "frontend/src/pages/RewardsPage.tsx": "Fetches user rewards and badge proofs to display dynamic scores, badges, and celebratory interactions.",
  "frontend/src/pages/ScaryHub.tsx": "Shows a themed hub of spooky mini‑games with sound toggles and surprise animations.",
  "frontend/src/pages/SeasonalEventsPage.tsx": "Displays seasonal themed activities, decorations, and stories with completion tracking and dialogs.",
  "frontend/src/pages/SmartHubPage.tsx": "Aggregates many activity types, showing personalized recommendations using user game state and rewards.",
  "frontend/src/pages/SpinWheelPage.tsx": "Implements a prize wheel with cooldowns, animations, and server‑driven rewards including points, badges, and extra spins.",
  "frontend/src/pages/StickerCreatorPage.tsx": "Provides a canvas-based drawing tool to create custom stickers, supporting touch/mouse drawing, color/brush controls, and saving uploads.",
  "frontend/src/pages/StoryBuilderPage.tsx": "A story creation UI that builds scenes with characters, props, and text, converting them to backend story formats and saving via mutations.",
  "frontend/src/pages/VideoGenerator.tsx": "UI for assembling simple themed videos with templates, characters, and stickers, allowing preview and export actions.",
  "frontend/src/pages/VideoGeneratorPage.tsx": "Generates animated video frames from a story input and selected character/background, rendering them on a canvas with play controls.",
  "frontend/src/pages/VideoHubPage.tsx": "Renders categorized kid-friendly YouTube channels with age groups, modal previews, and navigation. Manages selected channel/category state and handles blocked embeds.",
  "frontend/src/pages/VirtualPetHubPage.tsx": "Displays and customizes a virtual pet using saved backend data, including accessories, decorations, home styles, mood, and rewards. Syncs user progress and triggers feedback effects.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL. Supports both querystring and hash-based routing.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining content paths, theming, extended colors, fonts, container settings, and custom neon shadows. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for the Art Gallery app, tracking versions, known upload issues, and existing feature requirements to improve error handling and authentication flows."
}