{
  "backend/main.mo": "Main canister actor defining user profiles, game progress, events, chats, rewards, parental controls, and other app-related types with storage and access control initialization.",
  "feature_evidence.json": "Feature evidence report listing three Virtual Pet Hub reaction features with associated file paths, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend pages, hooks, and components including customization, games, data fetching, and visual effects.",
  "frontend/index.html": "Base HTML template that loads the React application via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React app routing component loading authentication logic, pages, and all game entries with theme and query providers.",
  "frontend/src/components/AchievementCelebration.tsx": "UI component that queues and displays confetti or fireworks celebration overlays using portals and timed removal.",
  "frontend/src/components/ApprovalPending.tsx": "Component gating access based on approval status, showing a request-approval flow or rendering children when approved.",
  "frontend/src/components/avatar3d/AvatarPreview3D.tsx": "3D avatar preview component allowing drag rotation and rendering avatar parts based on variant styles.",
  "frontend/src/components/avatar3d/AvatarRig.tsx": "Empty or placeholder file for avatar rigging logic.",
  "frontend/src/components/avatar3d/avatarVariants.ts": "Maps avatar configuration values to styled variant objects for body, head, hair, pants, headwear, and shoes.",
  "frontend/src/components/EmotionFeedback.tsx": "Displays temporary motivational messages via a portal and exposes a function to queue and show feedback with animations.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/GameLayout.tsx": "Provides a game UI wrapper with score display, navigation, trophy updates, and upgrade dialogs for pet-related rewards.",
  "frontend/src/components/Header.tsx": "Implements the main app header with authentication handling, navigation links, and optional admin access.",
  "frontend/src/components/HomepageFeatures.tsx": "Displays a grid of feature cards highlighting various app modules and creative tools.",
  "frontend/src/components/InstantMiniActivity.tsx": "Implements age‑based mini‑games with separate logic for tapping, matching, or challenge modes using canvas and timers.",
  "frontend/src/components/learn-hub/ArtsMusicActivity.tsx": "Implements multiple arts-related mini‑games like color mixing, drawing, rhythm, instruments, and creative prompts with progress tracking.",
  "frontend/src/components/learn-hub/DiscoveryZoneActivity.tsx": "Activity component providing facts, how‑it‑works steps, world explorer info, and invention‑based quizzes with scoring.",
  "frontend/src/components/learn-hub/ReadingVocabularyActivity.tsx": "Handles phonics, word building, stories, spelling, and vocabulary games with step progression and scoring.",
  "frontend/src/components/learn-hub/ScienceNatureActivity.tsx": "Defines a science-themed activity component with multiple game types and interactive steps for lessons.",
  "frontend/src/components/MascotGuide.tsx": "Shows a context‑aware mascot helper with optional voice narration and timed visibility.",
  "frontend/src/components/ProfileSetup.tsx": "Form component that collects a child's name and age, validates input, and saves a user profile via mutateAsync.",
  "frontend/src/content/seasonalEventStories.ts": "Provides a dataset of kid-safe seasonal event stories with narration scripts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling authentication, stored identities, and login state.",
  "frontend/src/hooks/usePetReaction.ts": "Hook managing temporary pet reactions like feed or play with auto-clearing behavior.",
  "frontend/src/hooks/useQueries.ts": "Contains type definitions and helpers for various app data models and queries using actor-based backend access.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, themes, and utility classes including neon and 3D avatar effects.",
  "frontend/src/main.tsx": "Application entry point setting up React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard displaying user management, restrictions, activity logs, and status updates using various query hooks.",
  "frontend/src/pages/ArtGalleryPage.tsx": "Page for uploading, previewing, and submitting artwork with authentication checks and file validation.",
  "frontend/src/pages/AvatarCreatorPage.tsx": "Avatar customization page allowing users to edit or randomize 3D avatar parts and save configurations.",
  "frontend/src/pages/CertificatesPage.tsx": "Generates and displays downloadable achievement certificates using canvas and user profile data.",
  "frontend/src/pages/ChatModule.tsx": "Simple chat interface with contacts, message history, and sending new messages in a monitored environment.",
  "frontend/src/pages/ChatPage.tsx": "Implements a real-time chat interface with online user polling, message sending, and auto-scrolling. Uses identity-based principals to send direct messages.",
  "frontend/src/pages/CraftDIYPage.tsx": "Displays craft project categories with filtering, mock fallback data, and project completion handling. Allows marking projects as completed and earning badges.",
  "frontend/src/pages/CreativeFunHub.tsx": "Shows a hub of creative entertainment modules like interactive shorts and karaoke. Each module card navigates to its respective feature.",
  "frontend/src/pages/DanceChallengePage.tsx": "Provides dance routines with timed pose progression and optional camera usage. Users can select routines, start/stop playback, and view poses step-by-step.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with searchable module cards for games, creativity tools, learning, and more. Supports admin-only modules and identity-based access.",
  "frontend/src/pages/EventCardCreator.tsx": "Lets users design event cards with templates, fonts, borders, and stickers. Supports previewing, downloading, and sharing cards with validation.",
  "frontend/src/pages/EventCardsPage.tsx": "Provides a UI for creating customizable event cards with templates, colors, and downloadable output using forms and tabs.",
  "frontend/src/pages/EventsModule.tsx": "Manages a list of events with creation, date selection, categorization, and rendering of event cards including type-based styling.",
  "frontend/src/pages/EventsPage.tsx": "Displays and manages events with reminders, date pickers, notifications, and CRUD-like form interactions.",
  "frontend/src/pages/FeedbackPage.tsx": "Implements a feedback submission form using API hooks and displays existing user feedback.",
  "frontend/src/pages/FeedbackSystem.tsx": "Provides an alternate feedback form with satisfaction ratings, type selection, and optional anonymity.",
  "frontend/src/pages/FunnyFartHub.tsx": "Renders a hub of selectable fart sound buttons with playback, randomization, and navigation controls.",
  "frontend/src/pages/games/AmbulanceRescue.tsx": "Implements a timed rescue game where the player moves an ambulance to collect randomly spawning patients and tracks score and high score.",
  "frontend/src/pages/games/BalloonPop.tsx": "Runs an animated balloon‑popping game using requestAnimationFrame, spawning balloons with types and scoring based on clicks.",
  "frontend/src/pages/games/BibbleAdventure.tsx": "Creates a platformer where the player jumps across platforms to collect coins while managing gravity and collision.",
  "frontend/src/pages/games/BirthdayCakeDecorator.tsx": "Lets users click to place emoji decorations on a cake, accumulating score and saving a high score on finish.",
  "frontend/src/pages/games/BirthdayCakeMaker.tsx": "Guides players through sequential steps to build a custom cake, earning points for each choice until completion.",
  "frontend/src/pages/games/BossesLearnHabits.tsx": "Defines a game where the boss learns player movement patterns and predicts attacks while the player shoots and dodges.",
  "frontend/src/pages/games/BossFightOnly.tsx": "Implements a boss‑only combat game with player movement, boss phases, projectiles, and reversible controls across multiple boss levels.",
  "frontend/src/pages/games/CatGrapplingHook.tsx": "Implements a physics‑based grappling hook game with a cat, collectible food, moving enemies, and momentum mechanics.",
  "frontend/src/pages/games/CityMovingPlatforms.tsx": "Provides a platformer with rotating platforms, gravity, movement, and scoring based on horizontal progress.",
  "frontend/src/pages/games/ControlEnemies.tsx": "Creates a game where the player indirectly guides a character by controlling enemies to clear a path toward a goal.",
  "frontend/src/pages/games/CronkerKontry.tsx": "Idle resource-building game managing gold, food, power, buildings, upgrades, achievements, and prestige with incremental production loops.",
  "frontend/src/pages/games/DelayedControls.tsx": "Canvas-based movement game where inputs are delayed before execution, featuring obstacles, coins, and a goal area.",
  "frontend/src/pages/games/DungeonJanitorSimulator.tsx": "Top-down cleaning game where the player moves around a dungeon clearing debris for points while new debris periodically spawns.",
  "frontend/src/pages/games/EclipseNowSolo.tsx": "Arcade survival shooter with enemy spawning, energy orb collection, AI hints, projectiles, and adaptive difficulty.",
  "frontend/src/pages/games/EnemiesPlatforms.tsx": "Platformer where flying enemies act as moving platforms, with jumping, collision handling, and level-based enemy generation.",
  "frontend/src/pages/games/EnemyControlsCamera.tsx": "Canvas-based game where an enemy controls the camera while the player collects coins and avoids being caught; tracks score, high score, and game over state.",
  "frontend/src/pages/games/EscapeRoomUniverse.tsx": "Multi-room escape game with timed item finding, room unlocking, scoring, and inventory progression across themed rooms.",
  "frontend/src/pages/games/EverythingBreaks.tsx": "Platformer where platforms break after use; player navigates physics-based movement to reach a goal while score and levels track progression.",
  "frontend/src/pages/games/EverythingIsButton.tsx": "Game filled with clickable buttons triggering random actions like teleporting or revealing the goal while player moves on canvas.",
  "frontend/src/pages/games/FamousPlaces.tsx": "Multiple-choice quiz game about identifying famous places, tracking score, high score, and progressing through questions.",
  "frontend/src/pages/games/FinalBoss.tsx": "Canvas defense game where players place traps to stop heroes from damaging a boss, with waves, scoring, and trap selection.",
  "frontend/src/pages/games/FloorIsLiar.tsx": "Platformer where players jump across misleadingly labeled platforms to reach a goal, with levels, gravity, and collision checks.",
  "frontend/src/pages/games/ForestNight.tsx": "Top-down movement game where players collect coins in low visibility before time runs out, with dynamic light radius and scoring.",
  "frontend/src/pages/games/GadgetCombat.tsx": "Arena game where players use gadgets to stun or capture enemies that chase them, with cooldowns, spawning, and scoring.",
  "frontend/src/pages/games/GlitchWorldEscape.tsx": "Platformer with glitch mode that toggles which platforms are solid while managing jumps, gravity, and falling hazards.",
  "frontend/src/pages/games/GrandmaSecretArcade.tsx": "Canvas-based arcade hub featuring three mini-games (whack-a-mole, catch, memory) with shared state and click-based interactions.",
  "frontend/src/pages/games/InventoryIsEnemy.tsx": "Movement and survival game where inventory weight slows the player and causes damage while navigating enemies and collecting items.",
  "frontend/src/pages/games/LiesAndTruths.tsx": "Platformer with randomized true/false hints affecting platform safety and progression toward a goal area.",
  "frontend/src/pages/games/MemoryMatch.tsx": "Emoji-based memory matching game with increasing grid size, scoring, level progression, and flip/match logic.",
  "frontend/src/pages/games/MindMazePuzzle.tsx": "Room-based puzzle game where each room contains a color, pattern, or sequence puzzle that must be solved to clear all rooms.",
  "frontend/src/pages/games/MonsterMaze.tsx": "Canvas maze game where the player moves through a grid avoiding moving monsters and reaching an exit while tracking score and high score.",
  "frontend/src/pages/games/MoveWhenBlink.tsx": "Canvas action game where the player can move only while blinking, avoiding moving enemies and reaching a goal to score points.",
  "frontend/src/pages/games/NumberRunner.tsx": "Lane‑running math game that spawns obstacles with math questions the player must answer while lanes shift and speed increases.",
  "frontend/src/pages/games/OneButtonHero.tsx": "One‑button timing game where tap, short hold, or long hold triggers jump, dash, or shield as obstacles spawn and score increases.",
  "frontend/src/pages/games/OneRoomInfiniteGames.tsx": "Single‑room engine that cycles through multiple mini‑games including dodge, collect, memory, and platforming while tracking score and timers.",
  "frontend/src/pages/games/PacMan.tsx": "Implements a grid‑based Pac‑Man clone with movement, ghosts, pellets, keyboard input, and maze initialization using React state and animation loops.",
  "frontend/src/pages/games/PauseMechanic.tsx": "Canvas game where the player collects coins and avoids hazards, featuring a pause system that triggers random effects like spawn, rewind, or teleport.",
  "frontend/src/pages/games/PoliceBuddyChase.tsx": "Lane‑based chasing game where the player moves left/right to catch criminals while avoiding escapes, with increasing speed and score tracking.",
  "frontend/src/pages/games/PumpkinSmash.tsx": "Canvas clicker game where bouncing pumpkins move around and the player clicks them to score before time expires.",
  "frontend/src/pages/games/ReverseProgression.tsx": "Platformer where abilities are removed each level, with player movement, platforms, enemies, and ability‑based mechanics like dash, shield, and slow‑time.",
  "frontend/src/pages/games/ScreenIsEnemy.tsx": "Canvas-based game where a player moves, collects coins, and triggers random screen effects while tracking score and game state.",
  "frontend/src/pages/games/ShapeShiftingWorld.tsx": "Top-down game where the player shifts forms to bypass obstacles and collect items across increasing levels.",
  "frontend/src/pages/games/SlimeEvolutionArena.tsx": "Canvas arena game where a slime evolves forms, avoids or interacts with enemies, and survives to increase score.",
  "frontend/src/pages/games/SoundBasedWorld.tsx": "Movement-and-sound-wave puzzle game where the player navigates obstacles and uses sound waves to reach a goal.",
  "frontend/src/pages/games/SpaceInvaders.tsx": "Classic Space Invaders clone with waves, shooting, enemy movement, score tracking, and player lives.",
  "frontend/src/pages/games/SpaceStationLife.tsx": "A resource‑management game where roles, random events, and movement affect score, resources, and survival over time.",
  "frontend/src/pages/games/SpeedIsHealth.tsx": "A canvas-based game where the player moves to maintain health, avoid obstacles, and collect coins while tracking score and speed.",
  "frontend/src/pages/games/SpiderWebPuzzle.tsx": "A puzzle game generating random node webs where players disconnect linked nodes to free all nodes across levels.",
  "frontend/src/pages/games/SuperpowerTraining.tsx": "A side-scrolling obstacle game where players use unlocked powers to avoid threats, hit targets, and increase score and level.",
  "frontend/src/pages/games/SuperSpeedyRacer.tsx": "A lane-based dodging racer where obstacles spawn, speed increases with score, and collisions end the run.",
  "frontend/src/pages/games/Tetris.tsx": "Implements a full Tetris game with board state, piece spawning, movement, rotation, collision, scoring, and game loop handling via refs and animation frames.",
  "frontend/src/pages/games/ThemeParkBuilder.tsx": "A park‑building sim where players place rides, earn income, manage happiness and visitors, and risk game over if happiness drops.",
  "frontend/src/pages/games/TicTacToe.tsx": "A Tic‑Tac‑Toe game supporting PvP and AI modes with winner detection, draw logic, and basic AI move selection.",
  "frontend/src/pages/games/TimeControlAdventure.tsx": "A realtime action game with time‑manipulation powers, enemy spawning, projectiles, coins, difficulty scaling, and a continuous game loop.",
  "frontend/src/pages/games/TimeLoopPizzaDelivery.tsx": "A canvas‑based delivery game where the player delivers pizzas, avoids obstacles, and resets via time loops when the timer expires.",
  "frontend/src/pages/games/TinyHeroGiantWorld.tsx": "Canvas platformer where a tiny player navigates a giant world, collects coins, and reaches a goal with physics, collisions, and camera tracking.",
  "frontend/src/pages/games/TutorialIsVillain.tsx": "Top‑down game where a deceptive tutorial spawns traps and hazards as the player moves toward a goal, with evolving messages and interactions.",
  "frontend/src/pages/games/WordWizard.tsx": "Word‑scramble game where players form words from shuffled letters under a timer, tracking score, high score, and found words.",
  "frontend/src/pages/games/YoureLateAlways.tsx": "Chaos‑survival game where the player dodges projectiles, fires, and explosions while progressing through escalating levels.",
  "frontend/src/pages/GamesHub.tsx": "Displays a grid of selectable games with icons and categories, handling trial limits and navigation.",
  "frontend/src/pages/GamesModule.tsx": "Provides a tabbed interface listing games by type with progress, difficulty, and selection handling.",
  "frontend/src/pages/GreenScreenFunPage.tsx": "Allows users to upload or capture a photo and overlay it onto cartoon scenes with download support.",
  "frontend/src/pages/InteractiveShortsPage.tsx": "Implements branching interactive stories with scene choices, endings, and story selection.",
  "frontend/src/pages/JokesGenerator.tsx": "Local joke generator with category filtering, random selection, favorites, sharing, and audio mock actions.",
  "frontend/src/pages/JokesPage.tsx": "Joke management page using API queries for browsing, submitting, rating, favoriting, and randomizing jokes.",
  "frontend/src/pages/KaraokeModePage.tsx": "Karaoke interface letting users pick songs, display timed lyrics, and control playback and volumes.",
  "frontend/src/pages/LearnHubPage.tsx": "Learning hub organizing themed lesson categories with progress tracking and activity components.",
  "frontend/src/pages/MusicRemixPage.tsx": "Music remix creation tool with loop selection, audio mixing, playback visualization, and remix submission.",
  "frontend/src/pages/ParentalControl.tsx": "Provides parental control UI for screen time, content filters, chat/video toggles, and admin user approvals using backend queries.",
  "frontend/src/pages/PreLoginExperiencePage.tsx": "Displays a pre-login landing page with hero content, optional redirect message, and Internet Identity login flow.",
  "frontend/src/pages/ProfileCustomization.tsx": "Allows users to edit and save profile details such as name, age, avatar, and theme using backend profile queries.",
  "frontend/src/pages/RewardsAchievements.tsx": "Shows static achievements, badges, points, levels, and progress within a rewards dashboard.",
  "frontend/src/pages/RewardsPage.tsx": "Fetches dynamic game stats and rewards to display earned badges, scores, and virtual pet progress with celebration effects.",
  "frontend/src/pages/ScaryHub.tsx": "Renders a themed hub showing spooky mini‑games with sound toggles, animated background effects, and surprise pop‑ups. Handles navigation and UI theming for each game card.",
  "frontend/src/pages/SeasonalEventsPage.tsx": "Displays seasonal activities, decorations, and stories based on the current month with tabs, dialogs, and interactive completion flow. Manages activity states, toast feedback, and event themes.",
  "frontend/src/pages/SmartHubPage.tsx": "Provides a smart activity hub that lists games and learning items with filtering, recommendations, and user progress data. Integrates queries for game states and rewards to personalize suggestions.",
  "frontend/src/pages/SpinWheelPage.tsx": "Implements a spin‑the‑wheel reward mechanic with cooldown tracking, animations, and reward handling. Saves spin timing in localStorage and shows prize history.",
  "frontend/src/pages/StickerCreatorPage.tsx": "Offers a canvas‑based drawing tool for creating stickers with adjustable brushes, colors, saving, and retrieval of approved stickers. Handles precise input events and canvas rendering logic.",
  "frontend/src/pages/StoryBuilderPage.tsx": "Interactive story builder that manages scenes, elements, and saving story projects via backend mutations.",
  "frontend/src/pages/VideoGenerator.tsx": "Simple video generator UI for selecting templates, characters, and stickers, with basic validation and preview placeholders.",
  "frontend/src/pages/VideoGeneratorPage.tsx": "Generates animated video frames from user input and renders them on a canvas with play controls.",
  "frontend/src/pages/VideoHubPage.tsx": "Displays categorized kid-friendly YouTube channels with selection dialogs and navigation support.",
  "frontend/src/pages/VirtualPetHubPage.tsx": "Manages a virtual pet’s state, customization, rewards, and creation flow using backend queries and mutations.",
  "frontend/src/utils/avatarConfig.ts": "Utility functions providing default avatar parts and merging user avatar config with defaults.",
  "frontend/src/utils/urlParams.ts": "URL and sessionStorage helpers for reading, persisting, and clearing URL parameters across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, OKLCH-based color palette, neon effects, container settings, and plugin integrations.",
  "project_state.json": "Defines the project's current state, known issues, existing features, and new feature requests for the Art Gallery and Virtual Pet Hub."
}