{
  "backend/main.mo": "Defines the main backend actor with storage mixins, access control, and extensive type definitions for users, games, AI behavior, events, chat, rewards, and parental controls.",
  "feature_evidence.json": "Feature evidence report describing a frontend update to VideoHubPage.tsx with related components, tests, and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files including pages, hooks, games, and components.",
  "frontend/index.html": "Basic HTML entry file that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React application router configuring global providers and routes for all pages and games.",
  "frontend/src/components/AchievementCelebration.tsx": "Renders confetti or fireworks celebration popups using a queue system and React portals.",
  "frontend/src/components/ApprovalPending.tsx": "Component that checks approval status and shows an approval request UI until access is granted.",
  "frontend/src/components/EmotionFeedback.tsx": "Displays animated positive feedback messages using a queue and portal-based notifications.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/GameLayout.tsx": "Layout wrapper for games handling navigation, scoring display, sound toggle, and trophy-based pet upgrades.",
  "frontend/src/components/Header.tsx": "Top navigation bar managing authentication, page navigation, and admin access display.",
  "frontend/src/components/HomepageFeatures.tsx": "Displays a grid of feature cards highlighting app modules with icons and descriptions.",
  "frontend/src/components/InstantMiniActivity.tsx": "Implements age‑based mini‑games with separate logic and state for tapping, matching, or challenge modes.",
  "frontend/src/components/learn-hub/ArtsMusicActivity.tsx": "Defines various arts and music mini‑games and a React component that runs step‑based activities with scoring and progress tracking.",
  "frontend/src/components/learn-hub/DiscoveryZoneActivity.tsx": "Contains discovery-themed fact, mechanics, geography, and invention games and a component that presents steps, quizzes, and story data.",
  "frontend/src/components/learn-hub/ReadingVocabularyActivity.tsx": "Implements phonics, spelling, vocabulary, and story‑based reading games with progress, scoring, and interactive answer handling.",
  "frontend/src/components/learn-hub/ScienceNatureActivity.tsx": "Provides weather, space, animals, and plant‑based educational games with quizzes and step progression in a React activity component.",
  "frontend/src/components/MascotGuide.tsx": "Floating mascot assistant that shows context tips and optional voice guidance based on the current page.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form collecting name and age and saving a new user profile via backend mutation.",
  "frontend/src/content/seasonalEventStories.ts": "Exports a dataset of kid‑safe seasonal stories including text and narration scripts for use in read‑along features.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login state handling and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines many TypeScript interfaces and wraps backend canister calls with React Query hooks for fetching and mutating application data.",
  "frontend/src/index.css": "Sets global styles, color variables, fonts, and Tailwind layers for both light and dark themes with neon accents.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements an admin dashboard UI with tabs, user management actions, restrictions, and activity views using data from custom query hooks.",
  "frontend/src/pages/ArtGalleryPage.tsx": "Provides an artwork gallery page allowing authenticated users to upload images, manage personal art, and view public submissions.",
  "frontend/src/pages/AvatarCreatorPage.tsx": "Provides an avatar builder with selectable parts, randomization, and save functionality using user profile and mutation hooks.",
  "frontend/src/pages/CertificatesPage.tsx": "Generates customizable achievement certificates on a canvas, manages user inputs, and lists existing certificates.",
  "frontend/src/pages/ChatModule.tsx": "Implements a simple contact-based chat UI with preset contacts, emojis, and local message handling.",
  "frontend/src/pages/ChatPage.tsx": "Implements real-time chat between online users with message polling, online status updates, and message sending.",
  "frontend/src/pages/CraftDIYPage.tsx": "Displays craft project lists by category, shows steps and materials, and allows marking projects as completed.",
  "frontend/src/pages/CreativeFunHub.tsx": "Renders a hub of creative modules with descriptions and navigation triggers for interactive content.",
  "frontend/src/pages/DanceChallengePage.tsx": "Interactive dance routine page letting users select routines, play timed pose sequences, and optionally enable a camera feed.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard listing navigable modules with search and admin‑aware visibility handling.",
  "frontend/src/pages/EventCardCreator.tsx": "Tool for designing customizable event cards with templates, fonts, stickers, and download/share actions.",
  "frontend/src/pages/EventCardsPage.tsx": "Card designer with templates, colors, and a preview, plus a gallery tab for saved cards.",
  "frontend/src/pages/EventsModule.tsx": "Event manager allowing users to add and view events with dates, types, icons, and details.",
  "frontend/src/pages/EventsPage.tsx": "Implements an events page with add/edit functionality and a notification component for today's events.",
  "frontend/src/pages/FeedbackPage.tsx": "Provides a feedback submission form with selectable types and displays the user's previously submitted feedback.",
  "frontend/src/pages/FeedbackSystem.tsx": "Implements an alternative feedback form collecting type, satisfaction level, title, description, and anonymity.",
  "frontend/src/pages/FunnyFartHub.tsx": "Renders a large list of themed fart sound buttons with playback controls and navigation handling.",
  "frontend/src/pages/games/AmbulanceRescue.tsx": "Top-down rescue game where players move an ambulance to pick up patients under a time limit.",
  "frontend/src/pages/games/BalloonPop.tsx": "Balloon popping game using requestAnimationFrame with scoring, effects, and timed gameplay.",
  "frontend/src/pages/games/BibbleAdventure.tsx": "Platformer where the player jumps across platforms to collect coins while avoiding falling.",
  "frontend/src/pages/games/BirthdayCakeDecorator.tsx": "A decoration game where users click a cake to place emoji decorations, track score, and finish to update high scores.",
  "frontend/src/pages/games/BirthdayCakeMaker.tsx": "A step-by-step cake creation game where players select base, flavor, and layers to earn points before finishing the cake.",
  "frontend/src/pages/games/BossesLearnHabits.tsx": "A boss battle where the boss learns player movement patterns and predicts attacks while the player shoots and dodges.",
  "frontend/src/pages/games/BossFightOnly.tsx": "A canvas-based boss fight with movement, attacks, projectiles, and multi-phase bosses, tracking score and high score.",
  "frontend/src/pages/games/CatGrapplingHook.tsx": "A physics-based grappling game where a cat swings to collect food, avoid enemies, and accumulate points.",
  "frontend/src/pages/games/CityMovingPlatforms.tsx": "Canvas platformer with moving rotating platforms, player physics, scoring, and game‑over handling.",
  "frontend/src/pages/games/ControlEnemies.tsx": "Game where the player auto-moves toward a goal while the user controls enemies to block or avoid them across levels.",
  "frontend/src/pages/games/CronkerKontry.tsx": "Incremental resource-building game with buildings, upgrades, achievements, and prestige progression.",
  "frontend/src/pages/games/DelayedControls.tsx": "Movement game where inputs are delayed via a queue, with obstacles, coins, and a goal.",
  "frontend/src/pages/games/DungeonJanitorSimulator.tsx": "Top‑down cleaning game where the player collects different debris types, gains points, and avoids losing while debris respawns.",
  "frontend/src/pages/games/EclipseNowSolo.tsx": "A solo space shooter managing player stats, enemies, projectiles, AI hints, difficulty scaling, and game loop state.",
  "frontend/src/pages/games/EnemiesPlatforms.tsx": "A platformer where flying enemies act as moving platforms, with player physics, enemy movement, collisions, and level progression.",
  "frontend/src/pages/games/EnemyControlsCamera.tsx": "A top-down game where the enemy controls the camera, with player movement, enemy patrol, coin collection, and camera tracking.",
  "frontend/src/pages/games/EscapeRoomUniverse.tsx": "An escape-room game managing themed rooms, item discovery, room unlocking, scoring, and a countdown timer.",
  "frontend/src/pages/games/EverythingBreaks.tsx": "A platformer with breakable platforms, player physics, level-based platform generation, and scoring.",
  "frontend/src/pages/games/EverythingIsButton.tsx": "Canvas-based game where the player moves and clicks randomly placed buttons that trigger effects, update score, and reveal a goal.",
  "frontend/src/pages/games/FamousPlaces.tsx": "Multiple‑choice quiz game asking locations of famous landmarks with score tracking and progression through predefined questions.",
  "frontend/src/pages/games/FinalBoss.tsx": "Canvas defense game where players place traps to stop advancing heroes from damaging a boss, with waves and scoring.",
  "frontend/src/pages/games/FloorIsLiar.tsx": "Platformer where players navigate mislabeled safe and dangerous platforms to reach a goal, with movement physics and level progression.",
  "frontend/src/pages/games/ForestNight.tsx": "Top‑down movement game collecting coins in darkness, managing visibility, timer, and score.",
  "frontend/src/pages/games/GadgetCombat.tsx": "Top‑down gadget combat game managing player movement, enemy pursuit, gadget effects, cooldowns, and score/high‑score state.",
  "frontend/src/pages/games/GlitchWorldEscape.tsx": "Platformer with glitch‑mode mechanics, handling player physics, platform collisions, level progression, and score tracking via canvas loop.",
  "frontend/src/pages/games/GrandmaSecretArcade.tsx": "Multi‑minigame arcade (whack, catch, memory) with shared state, canvas input handling, and rotating grandma messages.",
  "frontend/src/pages/games/InventoryIsEnemy.tsx": "Canvas action game where inventory weight slows and harms the player while navigating items, enemies, and a goal area.",
  "frontend/src/pages/games/LiesAndTruths.tsx": "Platforming game with randomized true/false hints, safe/unsafe platforms, player movement, and per‑level resets.",
  "frontend/src/pages/games/MemoryMatch.tsx": "Implements an emoji-based memory matching game with levels, scoring, card flipping logic, and dynamic grid generation.",
  "frontend/src/pages/games/MindMazePuzzle.tsx": "Creates a puzzle-room maze where each room has a color, pattern, or sequence puzzle that players solve to progress and score points.",
  "frontend/src/pages/games/MonsterMaze.tsx": "Implements a maze navigation game where the player moves through a grid while avoiding moving monsters and trying to reach the exit.",
  "frontend/src/pages/games/MoveWhenBlink.tsx": "A canvas-based stealth game where the player can move only while blinking, avoiding roaming enemies to reach a goal.",
  "frontend/src/pages/games/NumberRunner.tsx": "A runner game that generates moving math-problem obstacles which players solve by selecting the correct answer while avoiding collisions.",
  "frontend/src/pages/games/OneButtonHero.tsx": "Canvas-based runner where a single button controls jump, dash, and shield, with obstacle spawning and collision logic.",
  "frontend/src/pages/games/OneRoomInfiniteGames.tsx": "Framework for rotating mini‑games including dodge, collect, memory, and platformer modes with shared state and timers.",
  "frontend/src/pages/games/PacMan.tsx": "Grid-based Pac-Man clone managing maze generation, pellets, ghost movement, and directional input.",
  "frontend/src/pages/games/PauseMechanic.tsx": "Top-down coin‑collecting game with hazards and special pause-triggered effects like spawn, rewind, and teleport.",
  "frontend/src/pages/games/PoliceBuddyChase.tsx": "Lane-based chase game where the player catches criminals while increasing speed and avoiding missed captures.",
  "frontend/src/pages/games/PumpkinSmash.tsx": "Canvas-based clicking game where moving pumpkins bounce around, can be smashed for points, and the game ends on a timer.",
  "frontend/src/pages/games/ReverseProgression.tsx": "Platformer where abilities are removed each level, with player movement, enemies, platforms, and ability-based mechanics.",
  "frontend/src/pages/games/ScreenIsEnemy.tsx": "Top‑down coin‑collecting game where random screen effects hinder the player while managing health and movement.",
  "frontend/src/pages/games/ShapeShiftingWorld.tsx": "Movement and collection game where the player switches forms to bypass obstacles and advance levels.",
  "frontend/src/pages/games/SlimeEvolutionArena.tsx": "Arena survival game featuring a slime that evolves into forms with unique effects while avoiding or interacting with spawning enemies.",
  "frontend/src/pages/games/SoundBasedWorld.tsx": "Canvas-based navigation game where the player moves, emits sound waves, avoids obstacles, and tries to reach a goal while tracking score and game over state.",
  "frontend/src/pages/games/SpaceInvaders.tsx": "A Space Invaders clone with waves, enemies, bullets, movement, lives, and scoring handled via refs and a game loop.",
  "frontend/src/pages/games/SpaceStationLife.tsx": "Resource-management game where player roles affect income, events occur periodically, and depletion of energy ends the game.",
  "frontend/src/pages/games/SpeedIsHealth.tsx": "Movement-based survival game where player health depends on speed while collecting coins, avoiding obstacles, and staying alive.",
  "frontend/src/pages/games/SpiderWebPuzzle.tsx": "Puzzle game generating connected web nodes where players disconnect pairs to free all nodes across levels.",
  "frontend/src/pages/games/SuperpowerTraining.tsx": "Implements a movement-based obstacle game with unlockable powers, collision rules, scoring, and level progression.",
  "frontend/src/pages/games/SuperSpeedyRacer.tsx": "Implements a 3-lane racing game with obstacle spawning, collision detection, lane movement, scoring, and increasing speed.",
  "frontend/src/pages/games/Tetris.tsx": "Implements a full Tetris game including board state, piece generation, movement, rotation, line clearing, levels, and score tracking.",
  "frontend/src/pages/games/ThemeParkBuilder.tsx": "Implements a park-building sim with ride placement, income generation, happiness management, visitors, and game-over logic.",
  "frontend/src/pages/games/TicTacToe.tsx": "Implements Tic-Tac-Toe with PvP and AI modes, winner detection, draw logic, and simple AI decision-making.",
  "frontend/src/pages/games/TimeControlAdventure.tsx": "A fast‑paced time‑manipulation action game with enemies, projectiles, coins, and a requestAnimationFrame loop managing spawning and player state.",
  "frontend/src/pages/games/TimeLoopPizzaDelivery.tsx": "A canvas-based delivery game where the player delivers pizzas, avoids obstacles, and resets via time loops when the timer expires.",
  "frontend/src/pages/games/TinyHeroGiantWorld.tsx": "A side‑scrolling platformer where a tiny character navigates giant objects, collects coins, and reaches a distant goal.",
  "frontend/src/pages/games/TutorialIsVillain.tsx": "A comedic tutorial-turned-villain game where misleading instructions spawn traps, fake coins, and hazards as the player moves toward a goal.",
  "frontend/src/pages/games/WordWizard.tsx": "A word‑scramble puzzle game where players form words from shuffled letters under a time limit to score points.",
  "frontend/src/pages/games/YoureLateAlways.tsx": "React canvas-based mini-game with player movement, obstacles, explosions, fires, scoring, and restart logic managed via refs and a game loop.",
  "frontend/src/pages/GamesHub.tsx": "Displays a hub of available games with metadata including category, description, icons, and difficulty levels.",
  "frontend/src/pages/GamesModule.tsx": "Displays a tabbed game library with filtering, showing cards for predefined games and handling selected game state.",
  "frontend/src/pages/GreenScreenFunPage.tsx": "Provides a green‑screen photo tool allowing users to upload or capture an image and overlay it onto cartoon scenes.",
  "frontend/src/pages/InteractiveShortsPage.tsx": "Implements interactive branching stories where users select scenes and make choices that lead to different endings.",
  "frontend/src/pages/JokesGenerator.tsx": "Offers a local joke generator with categories, random selection, favorites, search, and share/audio actions.",
  "frontend/src/pages/JokesPage.tsx": "Integrates API-based joke browsing, submitting, rating, and favoriting with category filtering and random joke selection.",
  "frontend/src/pages/KaraokeModePage.tsx": "Provides a karaoke interface with selectable songs, timed lyric progression, and volume controls.",
  "frontend/src/pages/LearnHubPage.tsx": "Displays categorized educational lessons with progress tracking and activity components.",
  "frontend/src/pages/MusicRemixPage.tsx": "Allows users to mix audio loops, control playback, visualize audio, and save custom remixes.",
  "frontend/src/pages/ParentalControl.tsx": "Offers parental settings for screen time, content filters, chat/video toggles, and user approval management.",
  "frontend/src/pages/ProfileCustomization.tsx": "Enables users to edit profile details, avatar, and theme, loading and saving data via backend hooks.",
  "frontend/src/pages/RewardsAchievements.tsx": "Static achievements, badges, and challenges are displayed with progress, points, and styled cards.",
  "frontend/src/pages/RewardsPage.tsx": "Fetches user reward data and game states to compute badges, scores, and celebrations with interactive UI.",
  "frontend/src/pages/ScaryHub.tsx": "Shows a spooky-themed hub of mini‑games with animated effects, sound toggle, and surprise pop‑ups.",
  "frontend/src/pages/SeasonalEventsPage.tsx": "Displays seasonal activities, decorations, and stories with dynamic themes and completion tracking.",
  "frontend/src/pages/SmartHubPage.tsx": "Aggregates all activities and recommends items using user game states and rewards in a navigable hub.",
  "frontend/src/pages/SpinWheelPage.tsx": "Implements a spin‑wheel game with cooldown, animations, reward handling, and toast notifications using query hooks.",
  "frontend/src/pages/StickerCreatorPage.tsx": "Provides a canvas-based drawing tool to create custom stickers with color/brush controls and save functionality.",
  "frontend/src/pages/StoryBuilderPage.tsx": "Builds multi-scene story projects by placing characters, props, and text, and saves them to the backend.",
  "frontend/src/pages/VideoGenerator.tsx": "UI for selecting templates, characters, and settings to preview or export a simple themed video.",
  "frontend/src/pages/VideoGeneratorPage.tsx": "Generates animated videos from a story, character, and background by rendering timed frames on a canvas.",
  "frontend/src/pages/VideoHubPage.tsx": "Displays categorized kids' YouTube channels with modal previews and navigation support.",
  "frontend/src/pages/VirtualPetHubPage.tsx": "Manages a customizable virtual pet hub with naming, accessories, decorations, and save/load via hooks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing values from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining themes, colors, fonts, container settings, and plugin usage for styling.",
  "project_state.json": "JSON describing project state, feature requests, and requirements for gallery upload behavior and a kids video hub."
}