{
  "backend/main.mo": "Defines many user, game, event, chat, reward, and control data types and initializes access control and approval states for the backend actor.",
  "feature_evidence.json": "Feature evidence report linking a light‑theme color‑token update to the affected frontend CSS file and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend pages, hooks, and components including games, queries, styling, and feature behavior.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx with a root div container.",
  "frontend/src/App.tsx": "Main React app routing file wiring all pages, games, and UI providers such as themes, query client, and global layout components.",
  "frontend/src/components/AchievementCelebration.tsx": "Displays confetti or firework celebration overlays triggered globally through a queued event system using portals.",
  "frontend/src/components/ApprovalPending.tsx": "Shows approval‑required UI with request functionality and loads children only when the caller is approved.",
  "frontend/src/components/avatar3d/AvatarPreview3D.tsx": "Renders a 3D-style avatar preview with drag and touch rotation, pulling visual variants from avatarVariants and displaying parts like hair, head, and headwear.",
  "frontend/src/components/avatar3d/AvatarRig.tsx": "Empty or placeholder file for future avatar rig logic.",
  "frontend/src/components/avatar3d/avatarVariants.ts": "Provides functions that map avatar config values to style variants such as colors, sizes, and types for body, head, hair, pants, headwear, and shoes.",
  "frontend/src/components/EmotionFeedback.tsx": "Provides floating encouragement messages using a queue and portal‑based animated notifications.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text with a link to caffeine.ai.",
  "frontend/src/components/GameLayout.tsx": "Provides a game wrapper with scoring, sound toggle, navigation, and trophy-based pet upgrade logic.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, login/logout handling, and admin access controls.",
  "frontend/src/components/HomepageFeatures.tsx": "Displays the homepage feature grid with icons, descriptions, and a start button.",
  "frontend/src/components/InstantMiniActivity.tsx": "Implements three age-based mini‑games with canvas rendering, timers, and simple interactions.",
  "frontend/src/components/learn-hub/ArtsMusicActivity.tsx": "Implements multiple arts and music mini‑games—color mixing, drawing, rhythm, instruments, and creative prompts—with step tracking and scoring.",
  "frontend/src/components/learn-hub/DiscoveryZoneActivity.tsx": "Implements fact, how‑it‑works, world explorer, and inventions games with step progression, scoring, and optional invention story fetching.",
  "frontend/src/components/learn-hub/ReadingVocabularyActivity.tsx": "Provides reading and vocabulary mini‑games including phonics, word building, stories, spelling, and definitions with progress and scoring.",
  "frontend/src/components/learn-hub/ScienceNatureActivity.tsx": "Component defining multiple themed science mini‑games and rendering interactive lesson steps with scoring.",
  "frontend/src/components/MascotGuide.tsx": "Shows a context-aware mascot assistant with voice narration and dismissible help messages.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for creating a user profile with validation and backend mutation.",
  "frontend/src/content/seasonalEventStories.ts": "Exports a dataset of kid‑safe seasonal event stories with narration scripts and metadata.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks to manage Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines types and sets up query utilities using the actor and identity hooks for backend data operations.",
  "frontend/src/index.css": "Tailwind‑based global styles defining theme variables, dark mode, fonts, and utility classes including neon and 3D avatar effects.",
  "frontend/src/main.tsx": "Application entry point that mounts React, initializing QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page providing user management, status changes, restrictions, and activity logs with permission checks.",
  "frontend/src/pages/ArtGalleryPage.tsx": "Artwork upload and gallery page supporting file validation, previews, public/private submissions, and listing user/public art.",
  "frontend/src/pages/AvatarCreatorPage.tsx": "Avatar customization page allowing users to edit, randomize, preview, and save 3D avatar configurations.",
  "frontend/src/pages/CertificatesPage.tsx": "Certificate creation page generating personalized achievement certificates via canvas and listing existing certificates.",
  "frontend/src/pages/ChatModule.tsx": "Basic chat interface with contacts, message history, sending messages, and safety-focused UI elements.",
  "frontend/src/pages/ChatPage.tsx": "Chat interface showing online users, message history, and real-time messaging with auto‑refresh and status updates.",
  "frontend/src/pages/CraftDIYPage.tsx": "Displays categorized craft projects with steps, materials, badges, and completion handling, using mock data fallback.",
  "frontend/src/pages/CreativeFunHub.tsx": "Hub page listing creative entertainment modules and routing to each module on selection.",
  "frontend/src/pages/DanceChallengePage.tsx": "Dance routine player with timed pose progression and optional camera feed, allowing routine selection and playback control.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard listing all modules with search filtering, admin‑restricted items, and navigation handling.",
  "frontend/src/pages/EventCardCreator.tsx": "UI for designing event cards with templates, fonts, stickers, and actions to download or share the final card.",
  "frontend/src/pages/EventCardsPage.tsx": "Interactive card designer allowing users to select templates, colors, and enter text, with download validation and preview support.",
  "frontend/src/pages/EventsModule.tsx": "Event management module enabling creation, listing, and categorization of events with date selection and auto‑assigned icons.",
  "frontend/src/pages/EventsPage.tsx": "Full events manager with reminders, notifications, date picking, and CRUD-style interactions for personal events.",
  "frontend/src/pages/FeedbackPage.tsx": "Feedback submission interface with selectable feedback types, text input, and integration with query hooks for storing user feedback.",
  "frontend/src/pages/FeedbackSystem.tsx": "Standalone feedback form supporting mood selection, type categorization, anonymity, and simple validation before submission.",
  "frontend/src/pages/FunnyFartHub.tsx": "A playful UI listing many themed fart sounds with colors, emojis, and audio playback controls. Provides navigation and randomized sound features.",
  "frontend/src/pages/games/AmbulanceRescue.tsx": "Arcade-style rescue game where players move an ambulance to save patients before time runs out.",
  "frontend/src/pages/games/BalloonPop.tsx": "Implements a balloon‑popping game with timed spawning, animation, scoring, and pop effects using requestAnimationFrame. Manages game state with refs to avoid re-renders and includes a 60‑second timer and high score tracking.",
  "frontend/src/pages/games/BibbleAdventure.tsx": "Defines a platformer where the player moves, jumps, collects coins, and avoids falling, with gravity, platform collision, and keyboard controls. Tracks score, coin states, and high score.",
  "frontend/src/pages/games/BirthdayCakeDecorator.tsx": "Provides a click‑based cake decorating game where users place emoji decorations on a cake to earn points. Supports selecting decoration types, tracking placements, scoring, and finishing for bonus points.",
  "frontend/src/pages/games/BirthdayCakeMaker.tsx": "Implements a step‑based cake creation game where players choose a base, flavor, and layers to build a cake and earn points. Tracks game steps, selections, scoring, and high scores.",
  "frontend/src/pages/games/BossesLearnHabits.tsx": "Canvas shooter where the boss learns from recent player movement patterns and predicts attacks; handles movement, projectiles, and restart logic.",
  "frontend/src/pages/games/BossFightOnly.tsx": "Canvas‑based boss fight game with player movement, boss phases, projectiles, reversed controls, and scoring. Manages real‑time input and combat logic using a game loop and internal state refs.",
  "frontend/src/pages/games/CatGrapplingHook.tsx": "Physics game where a cat grapples toward clicked points, collects food, avoids enemies, and updates movement with gravity and friction.",
  "frontend/src/pages/games/CityMovingPlatforms.tsx": "Platformer with rotating moving platforms, gravity, jumping, and world rotation; tracks score by distance and triggers game over on falling.",
  "frontend/src/pages/games/ControlEnemies.tsx": "Player auto-moves toward a goal while the user controls selected enemies to block or avoid them; levels increase enemy count and scoring.",
  "frontend/src/pages/games/CronkerKontry.tsx": "Incremental resource-management game featuring buildings, upgrades, achievements, and prestige mechanics with per-second resource generation.",
  "frontend/src/pages/games/DelayedControls.tsx": "Canvas game where player movement is delayed via an input queue, with obstacles, coins, and collision-based scoring.",
  "frontend/src/pages/games/DungeonJanitorSimulator.tsx": "Top‑down cleaning game where the player clears debris types for points while debris respawns over time.",
  "frontend/src/pages/games/EclipseNowSolo.tsx": "Space survival shooter with moving enemies, collectible energy orbs, projectiles, AI hints, and adaptive difficulty.",
  "frontend/src/pages/games/EnemiesPlatforms.tsx": "Platformer where flying enemies act as moving platforms and hazards while the player jumps toward a goal.",
  "frontend/src/pages/games/EnemyControlsCamera.tsx": "Chase‑style game where the camera follows an enemy instead of the player while collecting coins and avoiding capture.",
  "frontend/src/pages/games/EscapeRoomUniverse.tsx": "Implements a timed multi-room item-finding escape game with room unlocking, scoring, and inventory management.",
  "frontend/src/pages/games/EverythingBreaks.tsx": "Canvas platformer where platforms break after use, with physics, level progression, and score tracking.",
  "frontend/src/pages/games/EverythingIsButton.tsx": "Canvas game where clicking randomly placed buttons triggers actions affecting movement, score, and revealing the goal.",
  "frontend/src/pages/games/FamousPlaces.tsx": "Multiple-choice quiz about famous places with scoring, answer feedback, and progression through preset questions.",
  "frontend/src/pages/games/FinalBoss.tsx": "Canvas defense game where players place traps to stop advancing heroes from damaging a boss, with waves and scoring.",
  "frontend/src/pages/games/FloorIsLiar.tsx": "Canvas-based platformer where players navigate platforms labeled truthfully or falsely, gain points by reaching the goal, and lose on unsafe platforms.",
  "frontend/src/pages/games/ForestNight.tsx": "Top-down movement game where players collect coins in darkness with shrinking visibility and a countdown timer.",
  "frontend/src/pages/games/GadgetCombat.tsx": "Player selects gadgets to stun or capture enemies approaching them while scoring and avoiding contact.",
  "frontend/src/pages/games/GlitchWorldEscape.tsx": "Platformer with glitch mode that changes which platforms are solid as the player climbs without falling.",
  "frontend/src/pages/games/GrandmaSecretArcade.tsx": "Multi-minigame arcade featuring whack-a-mole, catch, and memory games with score tracking and stateful canvas interaction.",
  "frontend/src/pages/games/InventoryIsEnemy.tsx": "Canvas-based game where player movement and health are affected by inventory weight while collecting items and avoiding enemies.",
  "frontend/src/pages/games/LiesAndTruths.tsx": "Platformer with randomized true/false hints where the player navigates platforms and reaches a goal while evaluating hint reliability.",
  "frontend/src/pages/games/MemoryMatch.tsx": "Emoji-based memory matching game with increasing grid size, scoring, and level progression.",
  "frontend/src/pages/games/MindMazePuzzle.tsx": "Room-based puzzle game where each room has a color, pattern, or sequence puzzle the player must solve to progress.",
  "frontend/src/pages/games/MonsterMaze.tsx": "Grid maze game where the player navigates to an exit while avoiding moving monsters and earning score for movement.",
  "frontend/src/pages/games/MoveWhenBlink.tsx": "Canvas game where the player can only move while blinking, avoiding enemies and reaching a goal to score points.",
  "frontend/src/pages/games/NumberRunner.tsx": "Lane‑runner math game that spawns moving obstacles with questions; players answer correctly to score and avoid collision.",
  "frontend/src/pages/games/OneButtonHero.tsx": "One‑button action game using press duration for jump, dash, or shield while avoiding scrolling obstacles.",
  "frontend/src/pages/games/OneRoomInfiniteGames.tsx": "Single-room game that cycles through multiple mini‑games like dodge, collect, memory, and platforming with a shared score.",
  "frontend/src/pages/games/PacMan.tsx": "Grid‑based Pac‑Man clone with movable ghosts, pellets, maze generation, lives, and standard arrow‑key movement.",
  "frontend/src/pages/games/PauseMechanic.tsx": "Canvas-based game where the player collects coins, avoids hazards, and triggers random pause effects that alter gameplay. Manages movement, collision, pause logic, and game state tracking.",
  "frontend/src/pages/games/PoliceBuddyChase.tsx": "Lane-based chase game where the player moves left/right to catch falling criminals before they escape. Handles spawning, movement, collision detection, and incremental difficulty.",
  "frontend/src/pages/games/PumpkinSmash.tsx": "Timed clicking game where pumpkins bounce around a canvas and award points when clicked. Handles animation, collision with walls, scoring, and respawning pumpkins.",
  "frontend/src/pages/games/ReverseProgression.tsx": "Platformer where abilities are removed each level while avoiding enemies and reaching a goal. Implements movement, abilities, platforms, enemies, and difficulty scaling.",
  "frontend/src/pages/games/ScreenIsEnemy.tsx": "Player collects coins while random screen effects like shake or shrink make navigation harder. Manages player movement, coin spawning, effect timing, and score tracking.",
  "frontend/src/pages/games/ShapeShiftingWorld.tsx": "Implements a top‑down shapeshifting game with movement, obstacle interaction based on form, and collectible-based level progression and scoring.",
  "frontend/src/pages/games/SlimeEvolutionArena.tsx": "Canvas-based arena game where a slime moves, evolves into forms with temporary abilities, and avoids or attracts procedurally spawned enemies.",
  "frontend/src/pages/games/SoundBasedWorld.tsx": "Canvas exploration game where movement generates sound waves for navigation, with obstacles, a goal, and simple collision handling.",
  "frontend/src/pages/games/SpaceInvaders.tsx": "React and canvas‑driven Space Invaders clone featuring waves of enemies, player bullets, movement controls, and wave-based progression.",
  "frontend/src/pages/games/SpaceStationLife.tsx": "Resource‑management game where the player selects roles, handles random events, moves on a map, and survives by maintaining resources over days.",
  "frontend/src/pages/games/SpeedIsHealth.tsx": "Canvas-based movement game where player speed affects health while avoiding obstacles and collecting coins.",
  "frontend/src/pages/games/SpiderWebPuzzle.tsx": "Node-click puzzle where players disconnect linked nodes to clear levels and free all nodes.",
  "frontend/src/pages/games/SuperpowerTraining.tsx": "Side-scrolling obstacle game with unlockable powers affecting movement and collision outcomes.",
  "frontend/src/pages/games/SuperSpeedyRacer.tsx": "Lane-based racing game where obstacles spawn and move downward as the player dodges to score points.",
  "frontend/src/pages/games/Tetris.tsx": "Tetris implementation handling tetromino spawning, movement, rotation, line clearing, and scoring.",
  "frontend/src/pages/games/ThemeParkBuilder.tsx": "React theme-park management game where players place rides on a grid, earn income, manage happiness, and avoid game over.",
  "frontend/src/pages/games/TicTacToe.tsx": "Tic‑tac‑toe game with PvP and AI modes, win detection, draw logic, and basic AI decision-making.",
  "frontend/src/pages/games/TimeControlAdventure.tsx": "Action game with time‑manipulation powers, spawning enemies, projectiles, and coins using a requestAnimationFrame loop.",
  "frontend/src/pages/games/TimeLoopPizzaDelivery.tsx": "Canvas-based delivery game where the player delivers pizzas, avoids obstacles, and resets via time loops when the timer expires.",
  "frontend/src/pages/games/TinyHeroGiantWorld.tsx": "Side-scrolling platformer set in a giant world with physics, collectible coins, and a goal object.",
  "frontend/src/pages/games/TutorialIsVillain.tsx": "Canvas-based mini-game where a villainous tutorial spawns traps, fake coins, and messages while tracking score, movement, and collisions.",
  "frontend/src/pages/games/WordWizard.tsx": "Word-scramble game that selects random words, tracks time and score, and lets players assemble letters to form correct words.",
  "frontend/src/pages/games/YoureLateAlways.tsx": "Chaos-themed canvas game with moving projectiles, fires, and explosions where the player avoids hazards and progresses through levels.",
  "frontend/src/pages/GamesHub.tsx": "Displays a catalog of games with icons, categories, difficulties, and navigation into selected modules. Uses cards and badges to show game info.",
  "frontend/src/pages/GamesModule.tsx": "Shows categorized game listings with tabs, progress, and high scores. Allows selecting a game and viewing details via reusable cards.",
  "frontend/src/pages/GreenScreenFunPage.tsx": "Lets users upload or capture photos and place them into cartoon scenes, with canvas compositing and image download. Includes camera integration and scene selection.",
  "frontend/src/pages/InteractiveShortsPage.tsx": "Implements an interactive branching story system with scenes, choices, and endings. Users pick a story, navigate scenes, and restart or return to the list.",
  "frontend/src/pages/JokesGenerator.tsx": "Static joke generator with categories, random selection, favorites, and simple share/audio actions.",
  "frontend/src/pages/JokesPage.tsx": "Dynamic jokes page using API hooks for listing, submitting, rating, and favoriting jokes with category filters.",
  "frontend/src/pages/KaraokeModePage.tsx": "Karaoke player showing song list, lyrics progression, and playback controls with adjustable volumes.",
  "frontend/src/pages/LearnHubPage.tsx": "Learning hub defining lesson categories and rendering interactive modules with progress and navigation.",
  "frontend/src/pages/MusicRemixPage.tsx": "Music remix builder allowing users to mix audio loops, control playback, visualize audio, and submit remixes.",
  "frontend/src/pages/ParentalControl.tsx": "UI for managing screen time, content filters, chat/video toggles, and admin user approvals using query hooks.",
  "frontend/src/pages/ProfileCustomization.tsx": "Loads and edits a user profile with name, age, avatar, and theme settings, then saves updates through backend hooks.",
  "frontend/src/pages/RewardsAchievements.tsx": "Displays static achievements, badges, challenges, and user stats like points and level.",
  "frontend/src/pages/RewardsPage.tsx": "Fetches and displays dynamic rewards, badges, and game stats, with badge interactions and celebration effects.",
  "frontend/src/pages/ScaryHub.tsx": "Shows a themed hub of spooky mini‑games with sound toggle and a timed surprise animation.",
  "frontend/src/pages/SeasonalEventsPage.tsx": "Renders seasonal event activities, decorations, and stories with dynamic themes and activity completion logic.",
  "frontend/src/pages/SmartHubPage.tsx": "Displays a hub of categorized activities and games using user data, allowing navigation to different modules.",
  "frontend/src/pages/SpinWheelPage.tsx": "Implements a spin‑wheel reward system with cooldowns, animations, and reward history integration.",
  "frontend/src/pages/StickerCreatorPage.tsx": "Provides a canvas-based drawing tool for creating and submitting custom stickers with brush controls.",
  "frontend/src/pages/StoryBuilderPage.tsx": "Enables building multi-scene stories with draggable elements and saves projects to the backend.",
  "frontend/src/pages/VideoGenerator.tsx": "UI for creating simple 2D videos using templates, characters, and basic settings with preview and export actions.",
  "frontend/src/pages/VideoGeneratorPage.tsx": "Generates animated video frames from a story and renders them on a canvas with character and background selection.",
  "frontend/src/pages/VideoHubPage.tsx": "Displays categorized kids’ YouTube channels with details and modal previews, organized by age groups.",
  "frontend/src/pages/VirtualPetHubPage.tsx": "Manages a customizable virtual pet with accessories, home styles, happiness logic, and persistent user data.",
  "frontend/src/utils/avatarConfig.ts": "Provides default avatar settings and a helper to merge user avatar configs with defaults.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, shadows, and container settings with custom UI tokens.",
  "project_state.json": "Metadata describing the project’s state and requirements for a focused UI color theme update without behavioral changes."
}