{
  "backend/main.mo": "Defines the actor backend with access control, user approval, storage mixins, and extensive type models for profiles, games, events, chat, rewards, and AI behavior.",
  "feature_evidence.json": "Lists feature evidence reports mapping two avatar-related features to affected frontend files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for multiple frontend files including pages, hooks, components, and game modules.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app router wiring all pages, providers, UI components, and 40+ game routes.",
  "frontend/src/components/AchievementCelebration.tsx": "Implements a global celebration system showing confetti or fireworks overlays via queued portal-rendered events.",
  "frontend/src/components/ApprovalPending.tsx": "Component gating children behind admin approval with request flow, loading UI, and styled approval prompt.",
  "frontend/src/components/avatar3d/AvatarPreview3D.tsx": "Interactive 3D avatar preview with drag-to-rotate controls and dynamic rendering based on avatar configuration.",
  "frontend/src/components/avatar3d/AvatarRig.tsx": "Empty placeholder file for future 3D avatar rig logic.",
  "frontend/src/components/avatar3d/avatarVariants.ts": "Provides functions that map avatar configuration values to visual variant styles for body, head, hair, pants, headwear, and shoes.",
  "frontend/src/components/EmotionFeedback.tsx": "Queued portal-based system showing animated motivational feedback messages with emojis.",
  "frontend/src/components/Footer.tsx": "Renders a footer with branding, a heart icon, and a link to caffeine.ai.",
  "frontend/src/components/GameLayout.tsx": "Provides a game screen layout with score display, navigation, trophy upgrades, and game-over handling.",
  "frontend/src/components/Header.tsx": "Displays the top navigation bar with login controls, navigation links, and optional admin access.",
  "frontend/src/components/HomepageFeatures.tsx": "Lists interactive feature cards highlighting various app modules and hubs.",
  "frontend/src/components/InstantMiniActivity.tsx": "Implements age‑based mini‑games with different game loops, scoring, and canvas interactions.",
  "frontend/src/components/learn-hub/ArtsMusicActivity.tsx": "Implements multiple arts and music mini-games such as color mixing, drawing, rhythm, instruments, and creative prompts with progress tracking.",
  "frontend/src/components/learn-hub/DiscoveryZoneActivity.tsx": "Implements discovery-themed games including facts, how‑it‑works items, world explorer content, and inventions, with step progression and scoring.",
  "frontend/src/components/learn-hub/ReadingVocabularyActivity.tsx": "Contains reading and vocabulary games such as phonics, word building, stories, spelling, and vocabulary quizzes with scoring and progress.",
  "frontend/src/components/learn-hub/ScienceNatureActivity.tsx": "React component defining multiple science mini-games (weather, space, animals, plants) and managing gameplay state and scoring.",
  "frontend/src/components/MascotGuide.tsx": "Shows a page‑aware mascot assistant that gives tips, optional voice guidance, and a toggleable help panel.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for creating a child profile, validating name and age, and saving via mutateAsync.",
  "frontend/src/content/seasonalEventStories.ts": "Exports a dataset of kid‑safe seasonal event stories with narration scripts and metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, stored identities, and auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines shared frontend types and integrates react‑query with the backend actor for user, activity, and project data.",
  "frontend/src/index.css": "Global Tailwind-based styles defining color themes, neon effects, typography, and 3D avatar utility classes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin interface providing user status management, restrictions, and activity viewing with role checks.",
  "frontend/src/pages/ArtGalleryPage.tsx": "Artwork upload and gallery browsing page with image validation, preview, and submission logic.",
  "frontend/src/pages/AvatarCreatorPage.tsx": "Avatar customization tool that loads user config, allows part selection or randomization, and saves updates.",
  "frontend/src/pages/CertificatesPage.tsx": "Generates achievement certificates using canvas and lists user certificates, supporting custom text.",
  "frontend/src/pages/ChatModule.tsx": "Simple chat UI with contact list, message history, and message sending for monitored communication.",
  "frontend/src/pages/ChatPage.tsx": "Implements a real-time chat UI with online users, polling, message sending, and auto-scrolling.",
  "frontend/src/pages/CraftDIYPage.tsx": "Displays craft project categories, shows filtered or mock projects, and allows marking projects as completed.",
  "frontend/src/pages/CreativeFunHub.tsx": "Shows a hub of creative modules and navigates to interactive entertainment features.",
  "frontend/src/pages/DanceChallengePage.tsx": "Provides selectable dance routines with timed pose progression and optional camera integration.",
  "frontend/src/pages/Dashboard.tsx": "Displays searchable dashboard of app modules with admin-aware visibility and navigation.",
  "frontend/src/pages/EventCardCreator.tsx": "Offers a card-design interface with templates, fonts, stickers, and share/download actions.",
  "frontend/src/pages/EventCardsPage.tsx": "Provides a UI for creating customizable event cards with templates, colors, and downloadable output.",
  "frontend/src/pages/EventsModule.tsx": "Implements an event manager allowing users to create, list, and organize events with dates, types, and metadata.",
  "frontend/src/pages/EventsPage.tsx": "Handles event creation, reminders, and notifications with a UI for managing local events and displaying alerts.",
  "frontend/src/pages/FeedbackPage.tsx": "Displays a feedback submission form supporting multiple feedback types and listing the user's previous submissions.",
  "frontend/src/pages/FeedbackSystem.tsx": "Provides an alternate feedback form with satisfaction ratings, feedback categories, and optional anonymity.",
  "frontend/src/pages/FunnyFartHub.tsx": "Provides a large list of themed fart sounds and UI to play them with controls for shuffle and mute, plus navigation back to the hub.",
  "frontend/src/pages/games/AmbulanceRescue.tsx": "A timed rescue game where players move an ambulance to save patients, track scores, and handle spawning and movement.",
  "frontend/src/pages/games/BalloonPop.tsx": "Implements an animated balloon‑popping game with spawning, movement, scoring, and timed play using requestAnimationFrame.",
  "frontend/src/pages/games/BibbleAdventure.tsx": "Defines a platformer where the player jumps across platforms, collects coins, and avoids falling to increase score.",
  "frontend/src/pages/games/BirthdayCakeDecorator.tsx": "Provides a click‑based cake decorating game where users place emoji decorations and earn points before finishing.",
  "frontend/src/pages/games/BirthdayCakeMaker.tsx": "Implements a multi‑step cake creation game where players choose base, flavor, and layers to build a cake and score points.",
  "frontend/src/pages/games/BossesLearnHabits.tsx": "Canvas shooter where a boss predicts player movement from recent key inputs and fires attacks accordingly; tracks score, patterns, and projectiles.",
  "frontend/src/pages/games/BossFightOnly.tsx": "Runs a canvas‑based boss fight with movement, attacks, projectiles, and multiple boss phases, tracking score and game over state.",
  "frontend/src/pages/games/CatGrapplingHook.tsx": "Physics-based grappling game where a cat swings toward clicked points, collects food, avoids enemies, and accumulates score.",
  "frontend/src/pages/games/CityMovingPlatforms.tsx": "Platformer with rotating moving platforms, gravity, and scoring based on distance traveled; player falls or reaches end to finish runs.",
  "frontend/src/pages/games/ControlEnemies.tsx": "Puzzle-action game where the player indirectly moves toward a goal while the user controls enemies to clear a safe path and advance levels.",
  "frontend/src/pages/games/CronkerKontry.tsx": "Idle/resource management game featuring buildings, upgrades, achievements, and prestige systems generating gold, food, and power over time.",
  "frontend/src/pages/games/DelayedControls.tsx": "Canvas-based game where player movement is delayed via an input queue while collecting coins and avoiding obstacles.",
  "frontend/src/pages/games/DungeonJanitorSimulator.tsx": "Top‑down cleaning game where the player moves around clearing debris types for points while new debris periodically spawns.",
  "frontend/src/pages/games/EclipseNowSolo.tsx": "Shooter‑survival game with enemies, projectiles, energy orbs, adaptive difficulty, and AI hint generation.",
  "frontend/src/pages/games/EnemiesPlatforms.tsx": "Platformer where flying enemies act as moving platforms and the player jumps toward a goal while avoiding collisions.",
  "frontend/src/pages/games/EnemyControlsCamera.tsx": "Game where an enemy's movement controls the camera while the player collects coins and avoids being caught.",
  "frontend/src/pages/games/EscapeRoomUniverse.tsx": "Implements a timed multi-room escape game with item finding, room unlocking, scoring, and inventory management.",
  "frontend/src/pages/games/EverythingBreaks.tsx": "Implements a platformer where platforms break after use, with physics, keyboard controls, and level progression.",
  "frontend/src/pages/games/EverythingIsButton.tsx": "Creates a canvas game where clicking randomized action buttons affects the player and goal visibility while scoring.",
  "frontend/src/pages/games/FamousPlaces.tsx": "Multiple‑choice quiz game about identifying locations of famous landmarks with scoring and progression.",
  "frontend/src/pages/games/FinalBoss.tsx": "Canvas defense game where players place traps to stop waves of heroes attacking a boss, with scoring and wave scaling.",
  "frontend/src/pages/games/FloorIsLiar.tsx": "Canvas platformer where platforms may lie about being safe, with level-based scoring and collision logic.",
  "frontend/src/pages/games/ForestNight.tsx": "Top‑down movement game where the player collects spawning coins before time runs out while managing visibility.",
  "frontend/src/pages/games/GadgetCombat.tsx": "Top‑down combat game where the player uses selectable gadgets to affect pursuing enemies and earn score.",
  "frontend/src/pages/games/GlitchWorldEscape.tsx": "Platformer using glitch mode to invert which platforms are solid while avoiding falls and progressing levels.",
  "frontend/src/pages/games/GrandmaSecretArcade.tsx": "Canvas-based arcade hub with three minigames—whack‑a‑mole, catch, and memory—tracking score and messages.",
  "frontend/src/pages/games/InventoryIsEnemy.tsx": "Canvas-based collection and avoidance game where inventory weight slows the player and affects health. Handles movement, item pickup/drop, enemy behavior, scoring, and game loop rendering.",
  "frontend/src/pages/games/LiesAndTruths.tsx": "Platformer where players navigate platforms based on hints that may be true or false. Includes jumping physics, platform safety logic, hints, scoring, and level progression.",
  "frontend/src/pages/games/MemoryMatch.tsx": "Emoji-based memory matching game with increasing grid size per level. Manages card flipping, matching logic, scoring, moves, and automatic level advancement.",
  "frontend/src/pages/games/MindMazePuzzle.tsx": "Room-based puzzle game where each room has a color, pattern, or sequence puzzle to solve. Tracks solved rooms, score, puzzle input, and ends when all rooms are completed.",
  "frontend/src/pages/games/MonsterMaze.tsx": "Grid maze game where the player navigates to an exit while avoiding moving monsters. Handles keyboard movement, monster AI, collision detection, scoring, and win/lose states.",
  "frontend/src/pages/games/MoveWhenBlink.tsx": "Canvas-based game where the player can move only while blinking, dodging moving enemies and reaching a goal to score points.",
  "frontend/src/pages/games/NumberRunner.tsx": "Lane‑runner math game where obstacles contain problems and the player selects answers to avoid collision and earn points.",
  "frontend/src/pages/games/OneButtonHero.tsx": "One‑button action game where tap, hold, and long‑hold trigger jump, dash, or shield while avoiding obstacles.",
  "frontend/src/pages/games/OneRoomInfiniteGames.tsx": "Single-room system cycling through dodge, collect, memory, and platformer mini‑games with shared player state and scoring.",
  "frontend/src/pages/games/PacMan.tsx": "Simplified Pac‑Man clone with grid movement, pellets, ghosts, lives, and a procedurally initialized maze.",
  "frontend/src/pages/games/PauseMechanic.tsx": "Canvas-based game where player collects coins, avoids hazards, and triggers random effects when pausing. Tracks score, high score, movement, hazards, and pause-driven state changes.",
  "frontend/src/pages/games/PoliceBuddyChase.tsx": "Lane-switching chase game where players catch criminals while avoiding escapes. Includes spawning logic, speed increases, scoring, and game-over detection.",
  "frontend/src/pages/games/PumpkinSmash.tsx": "Canvas click game with bouncing pumpkins; clicking removes pumpkins and increases score. Includes timer, spawn logic, and continuous animation of pumpkin movement.",
  "frontend/src/pages/games/ReverseProgression.tsx": "Platformer where abilities decrease each level; player navigates platforms, enemies, and a goal. Manages movement, abilities, cooldowns, and level-based resets.",
  "frontend/src/pages/games/ScreenIsEnemy.tsx": "Collection game where random screen effects hinder the player while collecting coins. Tracks movement, effects like shake or shrink, scoring, and canvas rendering.",
  "frontend/src/pages/games/ShapeShiftingWorld.tsx": "Implements a shape‑shifting exploration game with obstacles, collectible items, level progression, and keyboard‑controlled movement and form changes.",
  "frontend/src/pages/games/SlimeEvolutionArena.tsx": "Runs a canvas‑based survival game where a slime moves, evolves forms, and avoids or interacts with spawned enemies.",
  "frontend/src/pages/games/SoundBasedWorld.tsx": "Defines a navigation game using sound‑wave visualization, obstacle collisions, and movement‑triggered waves to reach a goal.",
  "frontend/src/pages/games/SpaceInvaders.tsx": "Implements a Space‑Invaders‑style shooter with player movement, waves of enemies, bullets, and a continuous game loop.",
  "frontend/src/pages/games/SpaceStationLife.tsx": "Creates a resource‑management simulation where a player role affects events, resources, scoring, and daily progression.",
  "frontend/src/pages/games/SpeedIsHealth.tsx": "Canvas-based movement game where player speed affects health, with obstacles, coins, and collision logic.",
  "frontend/src/pages/games/SpiderWebPuzzle.tsx": "Node-connection puzzle where players disconnect linked nodes across levels to free all nodes and win.",
  "frontend/src/pages/games/SuperpowerTraining.tsx": "Side-scrolling obstacle game where player uses unlockable powers to avoid or interact with obstacles and gain score.",
  "frontend/src/pages/games/SuperSpeedyRacer.tsx": "Lane-based racing game with falling obstacles, collision checks, increasing speed, and score progression.",
  "frontend/src/pages/games/Tetris.tsx": "Tetris implementation with piece generation, rotation, drop logic, scoring, and line-clearing mechanics.",
  "frontend/src/pages/games/ThemeParkBuilder.tsx": "Manages a park-building game with ride placement, income ticks, happiness, visitors, and game-over logic.",
  "frontend/src/pages/games/TicTacToe.tsx": "Implements Tic-Tac-Toe with PvP and AI modes, win detection, draw checks, and basic AI decision logic.",
  "frontend/src/pages/games/TimeControlAdventure.tsx": "Runs an action game with time powers, spawning enemies, coins, projectiles, and a frame-based game loop.",
  "frontend/src/pages/games/TimeLoopPizzaDelivery.tsx": "Canvas-based delivery game featuring time loops, obstacles, pizza deliveries, and persistent obstacle removal.",
  "frontend/src/pages/games/TinyHeroGiantWorld.tsx": "Side‑scrolling platformer where a tiny hero explores a giant world with physics, collisions, coins, and a moving camera.",
  "frontend/src/pages/games/TutorialIsVillain.tsx": "Canvas-based game where a misleading tutorial spawns traps and hazards, updating player state, messages, and collisions in a timed loop.",
  "frontend/src/pages/games/WordWizard.tsx": "Word-scramble game that tracks time, score, and found words while generating scrambled letters for players to assemble.",
  "frontend/src/pages/games/YoureLateAlways.tsx": "Action dodging game with chaotic projectiles, fires, and explosions where the player must survive and reach a goal.",
  "frontend/src/pages/GamesHub.tsx": "Displays a catalog of mini‑games with icons, categories, and difficulty options, allowing navigation into specific game modules.",
  "frontend/src/pages/GamesModule.tsx": "Shows a tabbed interface of games by type with progress, scores, and selection handling for an individual game.",
  "frontend/src/pages/GreenScreenFunPage.tsx": "Lets users upload or capture a photo, place it into cartoon scenes via canvas, and download the composited green‑screen image.",
  "frontend/src/pages/InteractiveShortsPage.tsx": "Implements interactive branching stories with scenes, choices, endings, and UI for selecting and navigating stories.",
  "frontend/src/pages/JokesGenerator.tsx": "React page that displays preset jokes, supports category filtering, random joke generation, favoriting, sharing, and audio playback.",
  "frontend/src/pages/JokesPage.tsx": "Jokes management page with API-backed browsing, submitting, rating, favoriting, and random selection of jokes.",
  "frontend/src/pages/KaraokeModePage.tsx": "Karaoke interface letting users select kid songs, play/pause lyrics progression, and adjust vocal/music volumes.",
  "frontend/src/pages/LearnHubPage.tsx": "Learning hub defining multiple educational categories and lessons, each with metadata and activity components.",
  "frontend/src/pages/MusicRemixPage.tsx": "Music remix builder allowing users to layer audio loops, control playback, visualize audio, and submit remixes.",
  "frontend/src/pages/ParentalControl.tsx": "Provides parental control settings including screen time, content filters, feature toggles, and admin user approvals.",
  "frontend/src/pages/ProfileCustomization.tsx": "Allows users to edit and save profile details such as name, age, avatar, and theme with backend integration.",
  "frontend/src/pages/RewardsAchievements.tsx": "Displays static achievements, badges, points, and progress in a rewards dashboard.",
  "frontend/src/pages/RewardsPage.tsx": "Shows dynamic reward data, badges earned, and game-related progress using backend queries.",
  "frontend/src/pages/ScaryHub.tsx": "Renders a themed hub of spooky mini‑games with sound toggles and animated surprise effects.",
  "frontend/src/pages/SeasonalEventsPage.tsx": "Displays seasonal event themes, activities, decorations, and stories with interactive actions and completion tracking.",
  "frontend/src/pages/SmartHubPage.tsx": "Shows a hub of categorized activities with navigation, difficulty filters, and user state integration.",
  "frontend/src/pages/SpinWheelPage.tsx": "Implements a spin‑the‑wheel reward system with cooldowns, animations, and reward history fetching.",
  "frontend/src/pages/StickerCreatorPage.tsx": "Provides a drawing canvas for creating custom stickers and submitting them to the backend.",
  "frontend/src/pages/StoryBuilderPage.tsx": "Allows users to build multi‑scene stories with characters, props, text, and save them to the backend.",
  "frontend/src/pages/VideoGenerator.tsx": "Interactive UI for creating simple 2D videos using templates, characters, and stickers with preview and export buttons.",
  "frontend/src/pages/VideoGeneratorPage.tsx": "Generates animated story-based videos by creating canvas-drawn frames with character motion and text.",
  "frontend/src/pages/VideoHubPage.tsx": "Displays categorized kids' YouTube channels with details and modal previews, organized by age groups.",
  "frontend/src/pages/VirtualPetHubPage.tsx": "Manages a virtual pet with naming, accessories, decorations, home styles, and persistence via user identity and backend hooks.",
  "frontend/src/utils/avatarConfig.ts": "Provides default avatar settings and merges user avatar configuration with defaults.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, and enabling plugins for typography, animations, and container queries.",
  "project_state.json": "Project metadata describing avatar creator enhancement features, versions, and pending requests."
}