{
  "kind": "build_request",
  "title": "Kids YouTube Videos Hub: Play embeddable videos on-site, otherwise redirect to YouTube",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update `frontend/src/pages/VideoHubPage.tsx` so that selecting a channel plays videos directly on the website when the channel is marked as allowed to embed, and otherwise prompts the user to watch on YouTube for channels marked as embed-blocked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make focused changes. No other CRUD or features to be changed. **Kids YouTube Videos Hub**- Show video on my website that are not having any copyrights. Rest can be shown via youtube channel."
        ]
      },
      "acceptanceCriteria": [
        "For a channel where `embedBlocked` is `true`, the channel detail view does not render an embedded player and instead shows the existing CTA to open the `channelUrl` on YouTube.",
        "For a channel where `embedBlocked` is not `true`, the channel detail view renders an on-site embedded player using that channel’s existing `embedUrl` (e.g., an `<iframe>` within the existing `aspect-video` container).",
        "The embedded player includes appropriate iframe attributes for video playback (e.g., `allow` for autoplay/encrypted-media/fullscreen as needed) and uses the existing `youtube-nocookie.com` embed URLs already present in the channel data.",
        "A visible \"Watch on YouTube\" button/link remains available in the channel detail view regardless of embed status, using the existing `channelUrl` and opening in a new tab.",
        "No other pages, navigation, CRUD flows, or backend code are changed."
      ]
    }
  ],
  "constraints": [
    "Make focused changes only for the Kids YouTube Videos Hub; do not change any other CRUD or features.",
    "Do not edit any files under `frontend/src/components/ui` or other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not implement automatic copyright detection or any API-based copyright checks.",
    "Do not add video upload/hosting features or store video metadata in the backend.",
    "Do not change the Art Gallery, Admin Dashboard, or any unrelated modules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}