{
  "kind": "build_request",
  "title": "Apply focused UI color theme update (background, cards, headings, buttons)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the global light theme color tokens so the app uses: main background #D6F0FF, cards/sections #FFFFFF, primary headings #2B2B2B, and primary buttons #FFE066 with dark text, without changing any app behavior or CRUD flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please make my background : #D6F0FF (light blue)\n\nSections/cards: #FFFFFF\n\nPrimary headings: #2B2B2B\n\nButtons: #FFE066 (yellow) with dark text"
        ]
      },
      "acceptanceCriteria": [
        "In light mode, the page background renders as hex #D6F0FF (or visually indistinguishable from it) wherever the app uses the global background token (e.g., Tailwind class bg-background).",
        "In light mode, card/section surfaces render as #FFFFFF wherever the app uses the card token (e.g., bg-card).",
        "Primary heading text (e.g., h1/h2/h3 or the app’s main page titles) renders as #2B2B2B by default unless a specific component intentionally overrides it.",
        "Primary buttons render with background #FFE066 and a dark, readable text color (e.g., #2B2B2B or equivalently dark).",
        "No backend canister methods, data types, or CRUD behaviors are modified."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Keep changes focused to styling only: do not refactor components, routes, queries, or state management; only adjust the minimum CSS/theme variables and any minimal, directly-related hardcoded color classes that prevent the new theme colors from applying.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make focused changes only. Ensure no other features or CRUD is impacted."
        ]
      },
      "acceptanceCriteria": [
        "Only styling/theme-related files (e.g., frontend/src/index.css and other CSS/theme configuration as strictly needed) are changed; no feature logic changes are introduced.",
        "All existing pages and modules remain functional and visually coherent after the color update (no unreadable text on buttons or backgrounds)."
      ]
    }
  ],
  "constraints": [
    "Make focused styling changes only; do not impact any other features or any CRUD behavior.",
    "Do not modify backend logic or storage.",
    "Do not edit any files under frontend/src/components/ui (read-only); compose existing components instead if needed."
  ],
  "nonGoals": [
    "Adding new features, pages, or UI components.",
    "Changing dark mode theme behavior unless required to keep text/button contrast acceptable in light mode.",
    "Any backend schema/state migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}