{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Strictly scoped login + trial gameplay access gating adjustments (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Keep all changes confined to authentication, pre-login experience, and trial-game allowlist gating without affecting existing modules or CRUD behavior.",
      "acceptanceCriteria": [
        "Authenticated users can still access and use all existing modules/pages with the same create/read/update/delete behavior as before.",
        "Unauthenticated users remain restricted to the pre-login experience and the defined trial game allowlist; attempts to access other pages continue to redirect/block with English messaging.",
        "No new pages/modules/features are introduced as part of this change set."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Tighten and centralize client-side access gating by exporting a single source of truth for the trial-game allowlist and unauthenticated page allowlist, and ensure redirect/block messaging remains English-only. Keep changes strictly limited to login/pre-login/trial gating. Use the selected \"authorization\" component’s frontend guidance to ensure unauthenticated users cannot access application data and that logout clears cached app data; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/GamesHub.tsx",
          "operation": "modify",
          "description": "Remove duplicated trial-game allowlist logic and consume the centralized trial allowlist exported from App-level gating so unauthenticated users can only launch allowlisted trial games, with consistent English lock/toast messaging. Keep changes strictly limited to trial gating behavior and do not alter game logic. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}