{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Focused light theme color token update (background, cards, headings, buttons)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update global light theme tokens so background, card surfaces, headings, and primary buttons match the provided hex colors without changing app behavior.",
      "acceptanceCriteria": [
        "In light mode, the page background renders as hex #D6F0FF (or visually indistinguishable from it) wherever the app uses the global background token (e.g., Tailwind class bg-background).",
        "In light mode, card/section surfaces render as #FFFFFF wherever the app uses the card token (e.g., bg-card).",
        "Primary heading text (e.g., h1/h2/h3 or the app’s main page titles) renders as #2B2B2B by default unless a specific component intentionally overrides it.",
        "Primary buttons render with background #FFE066 and a dark, readable text color (e.g., #2B2B2B or equivalently dark).",
        "No backend canister methods, data types, or CRUD behaviors are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust the light-mode CSS custom properties used by Tailwind tokens (bg-background/bg-card/text-foreground/bg-primary/text-primary-foreground) so they visually match: background #D6F0FF, card #FFFFFF, default primary text/headings #2B2B2B, and primary button background #FFE066 with dark text. Keep dark-mode variables unchanged unless strictly necessary for contrast."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep the change strictly styling-scoped by modifying only theme variables and minimal hardcoded color classes that block the new tokens from applying.",
      "acceptanceCriteria": [
        "Only styling/theme-related files (e.g., frontend/src/index.css and other CSS/theme configuration as strictly needed) are changed; no feature logic changes are introduced.",
        "All existing pages and modules remain functional and visually coherent after the color update (no unreadable text on buttons or backgrounds)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace hardcoded light-surface and text utility classes (e.g., bg-white/80, text-gray-600) with theme token-based classes (e.g., bg-card/opacity and text-foreground or text-muted-foreground equivalents) so the new global background/card/foreground tokens apply consistently, without changing component structure or behavior."
        }
      ]
    }
  ]
}