{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Kids YouTube Videos Hub: embed allowed channels, redirect embed-blocked channels",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Video Hub channel detail view to embed videos on-site when embedding is allowed, and otherwise show only the YouTube CTA while always keeping a Watch on YouTube link available.",
      "acceptanceCriteria": [
        "For a channel where `embedBlocked` is `true`, the channel detail view does not render an embedded player and instead shows the existing CTA to open the `channelUrl` on YouTube.",
        "For a channel where `embedBlocked` is not `true`, the channel detail view renders an on-site embedded player using that channel’s existing `embedUrl` (e.g., an `<iframe>` within the existing `aspect-video` container).",
        "The embedded player includes appropriate iframe attributes for video playback (e.g., `allow` for autoplay/encrypted-media/fullscreen as needed) and uses the existing `youtube-nocookie.com` embed URLs already present in the channel data.",
        "A visible \"Watch on YouTube\" button/link remains available in the channel detail view regardless of embed status, using the existing `channelUrl` and opening in a new tab.",
        "No other pages, navigation, CRUD flows, or backend code are changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideoHubPage.tsx",
          "operation": "modify",
          "description": "In the selected-channel detail view, conditionally render an on-site embedded YouTube player (<iframe>) inside the existing `aspect-video` container when `selectedChannel.embedBlocked` is not `true`, using the existing `selectedChannel.embedUrl` (which already uses `youtube-nocookie.com`). When `embedBlocked` is `true`, do not render the iframe and instead keep the current prompt/CTA messaging. Ensure a visible \"Watch on YouTube\" link/button remains present for both states, uses `selectedChannel.channelUrl`, and opens in a new tab with safe link attributes. Add appropriate iframe attributes for playback (e.g., `allow`, `allowFullScreen`, `title`, and related safety attributes) without changing any other pages or UI component files."
        }
      ]
    }
  ]
}